{
  "ministers": [
    {
      "id": "57d4d63e00310711b6a8fc12",
      "state": "published",
      "name": {
        "given": "James",
        "surname": "Kilgore",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2002,
      "dateOfBirth": "1926-09-23",
      "dateOfDeath": "2014-02-05",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Kilgore_James.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Kilgore_James.jpg",
        "biography": "James Kilgore was born September 23, 1926. His early life was spent traveling across the country with his ministering family, singing in the old brush arbors, building pulpits, altar benches, and churches, and eventually preaching the Gospel. \n\nOn September 13, 1949, he married Imogene Ellen Ritchie. The new couple began their marriage in the parsonage of their first church in Paris, Texas. When God called the Kilgore family to Houston eight years later, they left behind a growing congregation that today is still a thriving church.\n\nWhile in Paris, Brother Kilgore began a lifetime of service to the United Pentecostal Church when he was elected as the Texas District youth president. He served faithfully in that capacity from 1952 to 1960. A founding father of Texas Bible College, he served as its president from 1963 to 1964. At the 1971 General Conference in Houston, Texas, the ministers of the UPCI elected James L. Kilgore as the assistant general superintendent of the Western Division, an office he filled until he was elected as district superintendent of Texas in 1994.\n\nLiving his life to serve others has been his most fervent calling. The many that have been touched by his life remain committed to helping bring life to his vision of worldwide revival that began in his heart many years ago."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc11",
      "state": "published",
      "name": {
        "given": "Stanley",
        "surname": "Chambers",
        "prefix": "Rev.",
        "additional": [
          "W"
        ]
      },
      "ootfYearInducted": 2002,
      "dateOfBirth": "1915-07-20",
      "dateOfDeath": "2004-06-02",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Chambers_Stanley.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Chambers_Stanley.jpg",
        "biography": "Stanley W. Chambers was born July 20, 1915, in Columbus, Ohio. He was born again of the water and the Spirit at the church pastored by W. T. Witherspoon. It was in New York, while working in the church pastored by Andrew Urshan, that he received his call into the ministry. It was also in New York that he met his life’s companion, Catherine Strepka. Four children came from this union: Jean Catherine (Cowell), Judith Mae (Bentley), the late Lawrence Stanley, and Jerolyn Marie (Kelley).\n\nStanley Chambers began his full time ministry pastoring the church in Hazelton, Pennsylvania. In addition to this responsibility, he conducted a radio program and started a new congregation in Sunbury, Pennsylvania. He was also chosen to serve as the secretary of the eastern district of the Pentecostal Assemblies of Jesus Christ, to which he belonged.\n\nIn 1945, he and wife Catherine traveled to St. Louis to attend the conference in which the United Pentecostal Church was formed by the merging of the Pentecostal Church Incorporated (PCI) and the Pentecostal Assemblies of Jesus Christ (PAJC). In this merger, it was decided that Brother Howard Goss of the PCI would be the superintendent of the new organization and Brother Witherspoon would be the assistant superintendent. \n\nA secretary was needed for the new organization. Stanley Chambers was thirty years old at the time and had only held ministerial license for three years. It was required in the organizations by-laws that a man must hold ministerial credentials for five years before he could fill this office. The brethren voted to waive this ruling, and thus Stanley Chambers became the youngest man to ever hold high office in the United Pentecostal Church.\n\nBrother Chambers served efficiently and faithfully in this position for twenty-two years, under the leadership of Howard Goss and Arthur Morgan. Brother Morgan died as he was addressing a board meeting at the 1967 General Conference in Tulsa, Oklahoma. Brother Chambers was elected to serve as the new general superintendent.\n\nUnder Brother Chambers’s leadership, a new headquarters was built and paid for in Hazelwood, Missouri. For the first time the UPC published its own Sunday school curriculum entitled Word Aflame. He served in this position until he chose to step down in 1977.\n\nHe was chosen to serve as district superintendent of his home state of Missouri in 1983. He served for ten years and then chose to step down from his position as state superintendent.\n\nBrother Chambers continued preaching worldwide during the years that followed. One highlight of those years was the opportunity to serve as pastor of the church in Vienna, Austria, for an extended period of time. He continued to serve on committees and boards connected with the official work of the United Pentecostal Church. He was a long time member of the board of Tupelo Children’s Mansion."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc10",
      "state": "published",
      "name": {
        "given": "Cleveland",
        "surname": "Becton",
        "prefix": "Rev.",
        "additional": [
          "M"
        ]
      },
      "ootfYearInducted": 2002,
      "dateOfBirth": "1928-09-21",
      "dateOfDeath": "2010-11-16",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Becton_Cleveland.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Becton_Cleveland.jpg",
        "biography": "Born September 21, 1928, in Jackson, Tennessee, Cleveland M. Becton was the second son of James M. and Christine M. Becton. At the age of two, his family moved to Little Rock, Arkansas, where his mother’s brother, Reverend G. H. Brown, pastored a Pentecostal church. The family did not immediately attend the church that he pastored; however, after attending the First Baptist Church for a short period of time, his parents felt that they should make a change. This was the beginning of their experience of Pentecost, both parents receiving the Pentecostal experience.\n\nIn the summer of 1940, in a revival meeting with Brother Odell Cagle, Cleveland Becton received the baptism of the Holy Ghost and was baptized in the name of Jesus. At the age of fifteen, he left home with his parent’s consent and, properly chaperoned, played for the Stamps Quartette. At the age of sixteen, he was teaching piano and accordion in the Stamps School of Music in Dallas, Texas. \n\nPentecostal Bible Institute was opening for their first year in Tupelo, Mississippi. In the fall of 1945, along with approximately twenty-eight others, he became a pioneer student for the very first term. It was in the second semester of that year, while in a weekend service in Iuka, Mississippi, he felt the call into the ministry. He was seventeen years of age and started in the evangelistic work when that term ended. His first revival experience was in Nashville, Tennessee. His evangelistic days continued until the fall of 1950 when he took his first church to pastor in Bay City, Texas.\n\nWhile growing up in the church in Little Rock, Arkansas, Brother Becton met a family by the name of Dyson, also members of that church. They had several children, and one of them, a daughter named Margie, was about the same age as Cleveland. They were married in 1947. Right away she became an evangelist’s wife and three years later a pastor’s wife. \n\nThey had three wonderful children. Rudy was born in 1948 and traveled with them from the time that he was three weeks old until they settled down to pastor when he was two years of age. Ronald was born in 1952, in Bay City, Texas, where they continued pastoring until 1957. In 1957, they became the first pastor of  a small group of people in North Little Rock, Arkansas, and it was there they had their third child, a daughter, Renee, who made their family complete. They moved to Nashville, Tennessee, in 1960 to become the pastor of the West Nashville Pentecostal Church. The name was later changed to the First United Pentecostal Church.\n\nTheir three children are all married.  Rudy married Helen McNalley and they have two children, Alicia and Arlen.  Ronald married Cheryl Grisham and they have one son, Austin. Renee married Richard Flowers and they have two sons, Chad and Chase. All of them have been baptized in the name of Jesus and are filled with the baptism of the Holy Ghost. All of them, including the grandchildren, are working for the Lord.\n\nFollowing are the positions Brother Becton held in the United Pentecostal Church:\n1952-1957 Youth Secretary of the Texas District\n1958-1960 Home Missions Director of the Arkansas District\n1961-1967 Secretary of the International Youth Division\n1968-1976 General Secretary of the UPCI\n1978-1981 Assistant General Superintendent of the UPCI\n1982-1998 General Secretary of the UPCI\n1982- One of two speakers on Harvestime\n1999- Honorary UPCI General Board member\n\nIn the 1998 General Conference, held in Greensboro, North Carolina, Brother Becton felt he should not let his name stand any longer for the position of General Secretary. Brother Jerry Jones was elected at that conference to succeed him. A total of twenty-five years as General Secretary came to an end December 31, 1998. The Bectons moved to Texas and attended Emmanuel Pentecostal Church pastored by their son-in-law, Richard Flowers. They did not retire, but continued to travel for some time.  \n\nBrother Becton passed from this life November 16, 2010."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc13",
      "state": "published",
      "name": {
        "given": "Robert",
        "surname": "McFarland",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2002,
      "dateOfBirth": "1923-09-23",
      "dateOfDeath": "2002-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_McFarland_Robert.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_McFarland_Robert.jpg",
        "biography": "Robert Lester McFarland was born in Akron, Ohio, September 23, 1923, to Lester and Ethel McFarland. At twelve years of age, he moved with his family to a farm in Lynn, Indiana, where he later assisted his father in starting a Pentecostal church, and preached his first sermon at fifteen years of age. At age sixteen, he helped pioneer and pastor a church in Greenville, Ohio. He served as the vice president for the Indiana/Michigan District Pentecostal Young Peoples Association (PYPA) in the early 1940s, prior to the merger forming the United Pentecostal Church International (UPCI).\n\nWhile attending Apostolic Bible Institute in St. Paul, Minnesota, he pastored two congregations: Baronett and Spooner, Wisconsin. He married an ABI student, Marjorie Guinn of St. Louis, in 1944. They moved to Richmond, Indiana, where Robert began pastoring a small congregation. Here they were blessed with three children: Robert Lee, Lois Marie, and Edward Ray. New property was purchased, and with the help of his father, Robert, and the congregation he constructed a new church building and experienced steady growth during the next thirteen years. Brother McFarland resigned the pastorate in 1957 to become a full-time missionary to the Middle Eastern Arab nations. \n\nIn 1961, due to unrest in Jerusalem, he returned to the states and was unanimously elected as pastor when his father resigned in Marion, Indiana. Under his capable leadership, the congregation built and dedicated a new church facility, debt free. As the first Indiana District Bible quiz master, he established a strong Bible quizzing state.\n\nIn 1975, Brother McFarland was elected to serve full time as Indiana district superintendent, and moved to the Indiana parsonage on the campground. In addition to pastoring, he gave over half his life in faithful service to Indiana, by serving as youth secretary (1944-1953), district secretary (1953-1957; 1969-1970), Foreign Missions representative (1957-1961; 1967-1969), Home Missions director (1962-1967), and district superintendent (1970-1976). He was also an honorary member of both the Indiana District Board and the General Board (1990-2002).\n\nIn 1976, he was elected to serve as the general secretary of the United Pentecostal Church, in St. Louis, Missouri. His stewardship skills once again were rewarded by the mortgage on the World Evangelism Center being paid off seven years ahead of schedule. In 1981 he resigned as general secretary to become the regional director for Europe and the Middle East.\n\nHe returned to Indiana in 1991, and continued ministering anywhere God led. Pastor Dennis Croucher of Marion, Indiana, installed Brother McFarland as pastor emeritus of the First Pentecostal Church. Brother and Sister McFarland traveled several months presenting the cause of Mothers Memorial. He was involved in the formation of the Veterans of Foreign Missions for the UPCI and served as their first secretary."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc14",
      "state": "published",
      "name": {
        "given": "Paul",
        "surname": "Price",
        "prefix": "Rev."
      },
      "ootfYearInducted": 2002,
      "dateOfBirth": "1922-02-14",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Price_Paul.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Price_Paul.jpg",
        "biography": "Paul Price was born February 14, 1922, at Brookhaven, Mississippi. Until he was about thirteen years old, he lived in Jackson and Rolling Fork. At age twelve, he received the Holy Ghost in a revival meeting held on the front porch of his uncle’s home.    \n\nThe family then moved to Kerman, California, where a little church began in an outdoor tent meeting.  It was at this time that Paul gave his life to Jesus Christ never to look back. Elder Toole became his pastor. \n\nIn 1942, at the age of nineteen, Brother Price moved to Sacramento and met his wife to be, Alyce Hammond.  May 3 became the day of celebration as his seventeen-year-old bride and he took up their residence in a small house behind their grandmother’s place. Three daughters were born to them: Gaylyne, Renee, and Karla.  \n\nBrother and Sister Toole had been awakened to hear the Lord speak to get up and travel to Sacramento. In time, the Tooles gave up the work in the little country church, and Brother Price spent the next four years pastoring his home church. While there, he received a call from God to go to Napa, California, to start a home mission’s church, and he has been there for fifty-four years.\n\nHe was elected as the district superintendent of the Western District in 1965. He served on the General Board for thirty-four years and was a part of many committees. He also was chairman of the Building Committee to raise money for the new headquarters building in St. Louis, Missouri. He resigned the office of district Superintendent after serving in that position for thirty-four years."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc16",
      "state": "published",
      "name": {
        "given": "Nathaniel",
        "surname": "Urshan",
        "prefix": "Rev.",
        "additional": [
          "A"
        ]
      },
      "ootfYearInducted": 2002,
      "dateOfBirth": "1920-08-29",
      "dateOfDeath": "2005-05-11",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Urshan_Nathaniel.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Urshan_Nathaniel.jpg",
        "biography": "Nathaniel Andrew Urshan was born August 29, 1920, in St. Paul, Minnesota, to Andrew David and Mildred Hammergren Urshan. Brother Urshan lived in Chicago through most of his childhood and teen years. The family then moved to New York, where his father became pastor of the Apostolic Christian Church on 92nd Street in Manhattan.\n  \nAfter graduating from high school, Brother Urshan enrolled in Columbia University as a pre-med student. He attended the university for two and one-half years, desiring to be a surgeon.\n\nAfter being stricken with tuberculosis and then being miraculously healed, Brother Urshan realized that God had called him to preach and not to fulfill his own ambition to become a surgeon. Immediately, he began to preach revivals.\n\nNathaniel Urshan and Jean Habig were married on October 1, 1941. They conducted revivals in their early evangelistic days in Ohio, Idaho, Indiana, Pennsylvania, New York, Kentucky, Missouri, Arkansas, Michigan, Illinois, and West Virginia. The Urshans were blessed with four children: Sharon, Annette, Nathaniel Paul, and Andrew. Both sons became ministers, and both daughters became wives of ministers.\n\nIn February 1943 Brother Urshan became associate pastor to C. C. Kirby in Royal Oaks, Michigan, a position he held for two and one-half years. While serving under Pastor Kirby, the Urshans still held revival services in several parts of the nation. After leaving Royal Oaks, they returned to the evangelistic field for a short time.\n\nLater, Brother Urshan became assistant pastor to R. G. Hoekstra at Calvary Tabernacle, Indianapolis, Indiana. The Urshans left Indianapolis in 1947, to pastor Apostolic Christian Church on 92nd Street in Manhattan, New York. \n\nIn July 1949, Nathaniel A. Urshan became pastor of Calvary Tabernacle, Indianapolis, Indiana. He pastored there thirty years. As pastor, he positively influenced the community through his involvement in the International YMCA, the Heart Fund Campaign, the Cancer Society, and the Indianapolis Ministerial Association. Government contacts such as these have resulted in Brother Urshans being instrumental in opening doors to mission fields, including Ethiopia.\n\nDuring the years at Calvary Tabernacle, the Urshans had a fifteen-minute radio program called Hymns of Faith, which was aired five nights a week. The church also operated Calvary Christian School. \n\nIn the late 1940s, the Urshans, the Fred Kinzies, and the Norman Paslays formed the Gospel Melodies Record Company and made their own records.\n \nBrother Urshan served on the Board of Education of the United Pentecostal Church International (UPCI)for a number of years and Indiana District Board as the presbyter of Section Five for twenty-seven years.\n\nIn 1960, Brother Urshan became the Harvestime Radio speaker, a position he held for seventeen and one-half years. For the following twenty-four years, he has shared the Harvestime pulpit with other speakers.\n\nWhile pastoring Calvary Tabernacle, Brother Urshan served the UPCI as assistant general superintendent from 1971 to 1978. Honorary doctorate degrees were conferred upon Brother Urshan from Apostolic Bible Institute, Gateway College of Evangelism, and Christian Life College.\n\nAt the 1977 General Conference, the UPCI elected Brother Urshan as general superintendent, and he assumed that position January 1, 1978. The United Pentecostal Church International realized some major accomplishments during Brother Urshan’s superintendency. The following list gives tribute to his outstanding leadership:\n\n Addition of third floor to World Evangelism Center\n Acquisition of properties adjoining World Evangelism Center\n Release of the Siberian Seven\n Chaplaincy Program initiated\n World Network of Prayer established\n Registration of UPC in Russia, Kazakhstan, Egypt, Jordan, and Bethlehem, West Bank\n Publication of Spanish literature\n Youth on Missions began\n UPC Historical Center established\n North American Youth Congress initiated\n Junior Bible Quizzing instituted\n Multicultural Ministries began\n Endorsement of Lighthouse Ranch for Boys\n Endorsement of Spirit of Freedom Ministries\n Global Council began\n Daughters of Zion initiated\n World Evangelism Centers Information Technology Department established\n Spanish and French Harvestime broadcasts began\n Men’s Ministry introduced\n Urshan Graduate School of Theology established"
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc17",
      "state": "published",
      "name": {
        "given": "Tom",
        "surname": "Barnes",
        "prefix": "Rev.",
        "additional": [
          "W"
        ]
      },
      "ootfYearInducted": 2003,
      "dateOfBirth": "1913-07-12",
      "dateOfDeath": "2006-04-22",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Barnes_Tom.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Barnes_Tom.jpg",
        "biography": "On July 12, 1913, Lonzo and Margaret Barnes became the parents of Tom Willis Barnes. When Tom was two years old, his mother placed several toys and a Bible on a pallet in front of him. He reached for the Bible. His mother felt this was a sign her son would be used of God in a special way. A few years later, he told his mother that when he became twelve years old, something special would happen to him. Pentecost came to their little community when he was twelve years old; he and his mother were filled with the Holy Ghost and baptized in Jesus' name. Thus began a life of anointing on this man of faith.\n\nAt the age of twenty-four, he began preaching this Pentecostal message. Before he began preaching on his own, he was helping in a revival when a beautiful young lady, Lucille Farrington, came to the altar and received the Holy Ghost. On September 24, 1937, she became his wife. They have one child, Ruth, four grandchildren, and five great grandchildren.\n\nAfter evangelizing a while, Brother Barnes accepted the pastorate of a church in Pinegrove, Arkansas. In 1942 he pastored in the Shiloh community, and in 1943 he went to Pendall, Arkansas, and pastored there for four years. He preached in fourteen different communities in the Ozark hills. On Sunday he would preach three times in different churches and communities. \n\nAs he prayed one day, he was surprised when God told him he would be leaving Pendall in the near future. On September 8, 1947, he and his dear wife and daughter drove into Minden, Louisiana, to become pastor of the small congregation there. Not content to preach to just this small congregation, he began going out into the surrounding communities and holding services in people’s homes, in brush arbors in cotton fields, and in tents wherever he could find a place to put one, and in store front buildings. Many people received the Holy Ghost, and soon the small church in Minden could not hold the people. One of these revivals resulted in his building a church in Gibsland, Louisiana. For two years he pastored both churches, then felt led to call a permanent pastor for the Gibsland church. The Minden First United Pentecostal Church was blessed to have this man of God for their pastor for fifty-six years.\n\nFor nineteen years Brother Barnes served as Home Missions director for the Louisiana District. He touched the lives of thousands of young men and women during his thirty-six years as principal of the Louisiana District youth camps. \n\nHe is the author of three books: Living in the Overflow, Spiritual Warfare, and If You Need Healing.\n\nBrother Barnes is revered as a man of God in his community. Lawyers, judges, and law enforcement officers have relied on his advice and counsel for many years. In 1998 the Minden Chamber of Commerce named him Man of the Year.\n\nHe has preached many camp meetings and conferences. One highlight of his ministry was preaching in Jerusalem at the UPCI World Conference in 1976. His heartbeat for many years has been to pray for the Jews."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc18",
      "state": "published",
      "name": {
        "given": "William",
        "surname": "Cooling",
        "prefix": "Rev.",
        "additional": [
          "V"
        ]
      },
      "ootfYearInducted": 2003,
      "dateOfBirth": "1920-06-17",
      "dateOfDeath": "1992-06-10",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Cooling_William.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Cooling_William.jpg",
        "biography": "William Cooling was born in Winnipeg, Manitoba, Canada, on June 17, 1920. Weighing just over three pounds, he had no bone covering the back of his skull. For two weeks an aunt tended and prayed for him. One night as she repeated, “Victory! Victory!” she felt the bone in the back of his head grow, hence his middle name, Victor.\n\nHis parents, Thomas and Rose Cooling, were recent Pentecostal converts. Rose was baptized in Jesus' name just two weeks before Billie was born. Their life, as he grew up, revolved around revival services and prayer meetings. Even though Bill did not live for God during the five years he served in World War II, he went to church every time he had the opportunity. \n\nOn June 30, 1946, Bill, now almost an alcoholic, walked into the back of Bethel Tabernacle in Winnipeg. As the church sang, “Only Jesus, only Jesus, only He can satisfy,” he stumbled down the aisle, fell between the pews, and surrendered his life to God. Six months later, on New Year's Eve, he married a beautiful young lady, Georgina Fuller. \n\nAfter Brother Cooling felt the call to the ministry, he worked with his pastors, Brother Vouga and Brother Ralph Reynolds. Then, he stepped out with his family to pastor in Kenora, Ontario, Canada. Except for nine months in British Columbia, the rest of his ministry was in the Ontario district, pastoring in Pembroke, Brantford, St. Catharines, and Brockville. He was a true shepherd and believed and preached truth with an unwavering passion. Camp meeting was the highlight of his life, especially the morning Bible studies when he would lead the congregation in the old songs of the church, singing verse after verse by heart. His favorite was “My Savior’s Love.”\n\nBrother Cooling served the Ontario District as secretary and Home Missions director simultaneously for twelve years. During that time, the number of churches grew from twelve to thirty-two. He became district superintendent in 1973, and served until his death in 1992. For several years he served as president of the Apostolic Missionary Institute. He was the executive presbyter for Canada from 1990 to 1992. \n\nHe preached a message, “The Prayer of Jabez,” at the 1979 General Conference in Salt Lake City. For many years, he felt honored to sing Canada’s national anthem, O Canada, during the opening ceremony of General Conference.\n\nHis giving nature was his trademark. Every home missionary remembers his coming with his trunk full of groceries, including lots of treats for the children. He loved the Jamaican people, and they loved him. \n\nThe last service he attended, he was so weak that he sat in the second row, resting his head on the pew in front of him. Yet, when the altar call was given, he was the first one there, crawling on his hands and knees.\n\nOn June 10, 1992, he died of an enlarged heart. No one was surprised."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc19",
      "state": "published",
      "name": {
        "given": "James",
        "surname": "Lumpkin",
        "prefix": "Rev.",
        "suffix": "Sr.",
        "additional": [
          "G"
        ]
      },
      "ootfYearInducted": 2003,
      "dateOfBirth": "1929-10-26",
      "dateOfDeath": "2007-04-17",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Lumpkin_James.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Lumpkin_James.jpg",
        "biography": "James G. Lumpkin Sr. was born on October 26, 1929, in Columbus, Georgia. His mother trained him up in the way he should go and prayed earnestly that he would find a special partner in life, one who would share in his good and his quest for life’s best. He met that partner as a young soldier, and on August 13, 1949, James G. Lumpkin Sr. married Jean Rosebraugh.\n\nAlthough the Lumpkin-Rosebraugh union was a major milestone in the life of the Lumpkin family, the most important event occurred in the spring of 1951, in Sherman, Texas. The union was eternally sanctified as the Spirit of the Lord entered the lives of the young couple. \n\nBrother Lumpkin immediately felt there was a special call from the Lord on his life. In 1956 James and Jean moved with their family, which now included Jim Jr. and Mickey to St. Paul, Minnesota, for him to attend Apostolic Bible Institute (ABI). He graduated from there in 1959, and became a member of the school faculty for one year. In 1960 he assumed the pastorate of his first church in Knoxville, Iowa. While he was pastoring there, the second Lumpkin daughter, Tanya, was born.   \n\nJames Lumpkin returned to his alma mater to serve on the faculty of ABI from 1964 to 1965. The following year in St. Louis, Missouri, he became promotional director of the Harvestime radio broadcast, a position he held for one year. He then became director of the Harvestime radio broadcast, a position he held for four years. In 1969 he began pastoring in Fort Smith, Arkansas, a role he filled until 1984. In 1974 he was elected the district superintendent of the Arkansas District and was an exemplary leader of that state until 1996. He was founder of Northside Christian Academy in Fort Smith in 1978, and received the national Accelerated Christian Education Sword of the Spirit award in 1979.    \n\nBrother Lumpkin was an honorary member of the UPCI General Board, pastor emeritus of Northside United Pentecostal Church in Fort Smith, chairman of the Board of Directors of Tupelo Children’s Mansion, and vice president of Apostolic Bible Institute. He served as a member of the UPCI Executive Board, and as chairman pro tem of the UPCI Budget Committee. For more than twenty-five years, he served annually as the captain of the Tabulating Committee for the UPCI General Conference. He has also served on the Board of Directors of the Lighthouse Ranch for Boys and as chaplain of the Arkansas State Police. \n\nTheir son, Jim Lumpkin, and his wife, Jelaine, pastor in Little Rock, Arkansas. Their daughter, Mickey, and her husband, Anthony Mangun, pastor in Alexandria, Louisiana."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc1b",
      "state": "published",
      "name": {
        "given": "William",
        "surname": "Cole",
        "prefix": "Rev.",
        "additional": [
          "H",
          "\"Billy\""
        ]
      },
      "ootfYearInducted": 2004,
      "dateOfBirth": "1934-07-28",
      "dateOfDeath": "2009-07-27",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Cole_William.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Cole_William.jpg",
        "biography": "At the age of nineteen, Billy married Shirley Ann Kelbaugh in Parkersburg, West Virginia, on December 22, 1953. After moving to Weirton, West Virginia, for work in the laboratory at Weirton Steel, he recognized that God was calling him to preach. They began their ministry by going door to door witnessing. Pastor Allen Cayton came to them after a Sunday morning service and asked, “Why haven’t you told me God has called you to preach?” Later, without notice, Pastor Cayton called upon Billy to preach. After his first sermon, a Catholic lady, whom the Coles had brought to church, received the Holy Ghost. \n\nThe Coles' first major effort was to open a new church in Ravenswood, West Virginia. Not a single Pentecostal resided in the whole county. They began by pitching a small tent and preaching every night for a month, resulting in sixteen adults being baptized in Jesus' name. That church is now pastored by a convert of Brother Cole’s, Reverend T. J. Johnston. There is now a wonderful congregation there, housed in a beautiful new building.\n\nAfter pastoring in Ravenswood a few years, Brother and Sister Cole traveled as evangelists. A number of people received the Holy Ghost and were baptized. During this time they also witnessed several notable apostolic events. They then pastored a church in Spencer, West Virginia, with a congregation of one hundred people. The church was debt free when the Coles moved on.\n\nThe Coles were invited to Elyeria, Pennsylvania, to preach for their former pastor, Brother Cayton, who was starting a new home mission’s church. It was while they were here, they felt their call to the Thailand as missionaries.\n\nIn seven years they baptized nearly 6,000 Buddhists and witnessed a mighty outpouring of the Holy Ghost. One of their first converts, Reverend Chaiyong Wattanachant, has been superintendent of the Thailand churches for more than thirty-five years.\n\nWhile in Thailand, Brother Cole suffered a stroke, which paralyzed his left arm. The Coles returned to the US. However, upon his being healed, they returned to Asia as evangelists. Thousands were baptized and filled with the Holy Ghost. When Sister Cole became sick, they returned to the US again. When her health improved, they went to Wheeling, West Virginia.The Wheeling church is now pastored by Reverend David Forsythe, an elder mentored by Brother Cole.\n\nAfter leaving Wheeling, the Coles returned to evangelizing overseas. When Brother Cole’s father asked him to come home to help build a new building in Parkersburg, West Virginia, he did. When this building was finished in 1981, the Coles moved to Charleston, West Virginia, to pastor the North Charleston Apostolic Church. They have remained in Charleston for over twenty-three years. Three years ago, Brother Cole’s grandson, Reverend Anthony Moss, took over the church upon Brother Cole’s retirement. \n\nBrother Cole preached many camp meetings and revival services, seeing many filled with the Holy Ghost. The last ten years of his ministry, he preached crusades at home and overseas. On sixteen occasions, more than 3,000 received the Holy Ghost in a single service. The Coles preached for fifty years and were just short of seeing one million people receive the Holy Ghost. They were diligent in training many young men, too numerous to mention, to carry on their ministry.\n\nBrother Cole served on the Executive Board for two terms, and also served on the Foreign Missions Board."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc1a",
      "state": "published",
      "name": {
        "given": "Carl",
        "surname": "Stephenson",
        "prefix": "Rev.",
        "additional": [
          "H"
        ]
      },
      "ootfYearInducted": 2003,
      "dateOfBirth": "1931-01-01",
      "dateOfDeath": "2003-04-09",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Stephenson_Carl.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Stephenson_Carl.jpg",
        "biography": "In July 1931 Carl Stephenson was born near Nacogdoches, Texas, to Emma and Guy Stephenson. At age ten, Carl was taken to a Oneness Pentecostal church by his grandmother, where he heard the message of New Testament salvation and was baptized in Jesus' name. \n \nIn 1947 Carl attended a revival by Reverend E. L. and Nona Freeman. There he repented of his sins and received the gift of the Holy Ghost, speaking with other tongues. After graduation, Carl worked as an apprentice plumber; then God gave him a preaching ministry.\n\nIn 1949 he was granted a Christian Workers license by the First Pentecostal Church of Kilgore, Texas, and began holding revivals, beginning at Etoile, Texas. He studied and prayed, ate whatever was provided, and fasted often. God blessed his ministry. \n\nBrother Stephenson received his local license and general license, and he was ordained by the United Pentecostal Church at the Texas District Conference in 1953. He preached in Texas, Louisiana, Michigan, Indiana, and other states. \n\nIn 1954 Carl was married to Nell Walton. In 1955, they moved to Winnipeg, Manitoba, Canada, and he became the pastor of Bethel Tabernacle. During the twelve years in Winnipeg, souls were born again and the church building was renovated. The family grew to include Becky, Kathy, Lisa, and David; all (and their own families) have been born again and continue to serve the Lord. \n\nCarl served as district presbyter and youth president of the Minnesota-Manitoba District. \n\nIn 1967 Brother Stephenson was elected pastor of First United Pentecostal Church on Greenwood Avenue in Toronto, Ontario, Canada. The church building was renovated and the established culture of giving was continued. Record offerings were made, especially for Foreign Missions and Sheaves for Christ.\n\nHe was the Ontario District Foreign Missions director for thirty years. He also served on the Foreign Missions Board and made several overseas trips, preaching conferences and dedicating buildings. \n\nBrother Stephenson taught at Apostolic Missionary Institute for many years, taking a Greyhound bus from Toronto to Picton and, later, the train to London. He taught doctrine, missions, and pastoral theology. He was district presbyter for eighteen years and then district superintendent for over ten years. \n\nIn 1998 Carl Stephenson resigned his pastorate, taking the role of senior minister. This change allowed him to visit more Ontario churches, supporting the local saints and pastors. His Sunday morning Bible class at Greenwood provided continuity and a blessing to all who attended.\n\nHis last two messages were preached on April 6, 2003: “Why Jesus Has Not Yet Come” and “My Greatest Hope: The Rapture.” On April 9 Brother Stephenson unexpectedly passed on into the arms of Jesus, ending a full and rewarding life of ministry."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc1c",
      "state": "published",
      "name": {
        "given": "E",
        "surname": "Freeman",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2004,
      "dateOfBirth": "1917-01-01",
      "dateOfDeath": "1999-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Freeman_E.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Freeman_E.jpg",
        "biography": "E. L. and Nona met January 25, 1937. Love came instantly, though both were in denial about a call to preach and a call to Africa, so that they did not mention it to each other. God called Brother Freeman before his seventh birthday and Sister Freeman at age eleven with the infilling of the Holy Ghost.\n  \t\nI collapsed at college in March that year and was sent home from the hospital with thirty-six hours to live. Death came, but during those thirty minutes of time when my heart did not beat and I did not breathe, I met Jesus face to face. I confessed my disobedience and failures and promised to do His will if He would allow me to come back. He graciously forgave me and sent me back. My life turned around at twenty. Because of Bugs apparent lack of spirituality, I immediately broke our engagement, but Jesus has His own beautiful and exquisite ways of working out His will in human lives.\n\nGod later let me know that our marriage agreed with His will, so we were married in August, still keeping our secrets. God said I must be still and let Him guide us. Bugs ambition lay in the business world where he had wonderful opportunities, though he had long sought earnestly for the Holy Ghost. When he decided to surrender to God’s will and preach, the Spirit came on him wonderfully and he talked in tongues for three days. His preaching (and mine) began in a revival in New Mexico, April 1939. In that revival, Jesus told on us about Africa, and from that hour, our predominant thoughts concentrated on GOING.\n\nOur deep desire to get to Africa moved us to drive from New Mexico to St. Louis, Missouri, in September 1939 (with great difficulties and without needed necessities) to meet the missionary board. They felt insulted (rightly so) that with only five months preaching experience, we would meet them wanting to be appointed to Africa. This was simple ignorance on our part. However, they gave us good advice: “Don’t trade on a missionary call; work for God—hold meetings, start a new work, go through every door God opens—and come back in three years.”\n\nWithout resentment, we took their advice and tried to meet the board again in 1941 and 1942, but they did not have time to see us. By this time, we were pastoring our second church in Louisiana. We asked if we could see them at the Conference in 1943. The meeting would begin at 1 p.m. and end about 6 p.m. If we were there and they had time, they would talk to us. We got to the appointed place at 12:30 p.m. When their meeting ended at 6:30 p.m., they marched out and said, “Sorry, we didn’t have time to talk to you this year; come back next year.”\n\nMy husband immediately began to encourage me to have the right attitude and not resent anything, promising that we when we returned home we would be able to settle everything by prayer. In that all night prayer meeting, God gave me a Scripture verse: “Ye have not chosen me, but I have chosen you, and ordained you that ye should go and bring forth fruit” (John 15:16). As I read this to my husband, I started shouting. He had received the same verse and finished reading it: “…and that your fruit should remain: that whatsoever ye shall ask of the Father in my name, he may give it you.”\n\nAt a Louisiana district conference in 1944, the missions director announced that we had a missions call. Our precious friend, George Glass Sr., said, “We love the Freemans and do not want them to leave us, but if they have a call to Africa, we need to send them. Bring your gifts to them and put it in the guitar case!”\n\nEveryone began to weep and most of them made several trips to the case to add to that offering. The war raged then, and America still felt the steely grip of depression, but $3,400 resulted. Three weeks later we received a letter from the board appointing us to Africa, if I could pass a doctors examination on being able to go. When I was fifteen, a doctor had discovered that I had only one lung, but Jesus gave me a new one just in time, so I passed the test. In March 1948, that offering paid the Freemans' fare to Africa on a cargo boat with five children, ages ranging from nine years to six months. There were no planes to Africa then.\n\nI’ve written books about our forty-one years of adventure in Africa which prove beyond a shadow of doubt that the incomparable grace of Jesus is sufficient for every situation. No matter how ugly or desperate the situation, He is forever able! One of the most amazing things Jesus did early in our journey was guiding Brother Freeman to visit other African countries by faith and claim them for Jesus. Within a short time of his unofficial visits when he walked over that country and claimed it, someone in America would get a burden for that land and GO! Then, speedily, revival’s flame would blaze from unexpected quarters. Speaking of revivals, we saw incredible miracles of healing and salvation in the twenty years of tent revivals that we held, often under very challenging conditions all over the country, a rich reward for the small sacrifices we made.\n\nAll the missionaries that went before us to Africa were sent to Liberia, a small country on the west coast known as the white man’s grave. E. L. Freeman refused to go there. He said, I am not afraid of the climate, but the rest of that vast continent needs the true gospel! He carried an immense burden for Africa, and, after twenty-three years in South Africa, the board handed him the whole continent except for the five countries at the top of it (they fall with the Middle East region.) \n\nDuring the time T. F. Tenney served as the missions director, for two years he arranged for us to visit, encourage, and try to open other countries. We continued to do this for another eighteen years after Bug's appointment as regional field supervisor (now known as regional director). We had many more adventures in Jesus' name, trying to open up new areas for the preaching of this glorious gospel, and saw unusual success in that endeavor.\n\nSomewhere along there, my dearest Bug had to go to St. Louis for a board meeting while I remained in Africa. Jesus visited me in a vision saying, the churches in America are in trouble, the affluence of America has robbed them of their trust in me, and they don’t even realize it. I’m cutting your missionary work short and sending you back to America. Accept every invitation you get to visit the churches and tell them what you have seen me do and what I can do for them. \n\nWhen Bug came back, he excitedly told of having the same vision. Shortly after that the Board decided we were getting too old to be missionaries. We knew why! We came back to America in 1989 and together we did what He said for ten years. There were also some visits overseas. Then my darling got the call to go higher in 1999, but before he left me he told me what to do. Keep on doing what you are doing and be happy.\n\nA near-fatal accident in Kenya, Africa, in 1973 taught us the beautiful message of praise and worship. It still sustains me at eighty-eight as my beautiful daughter, Sandra Freeman lives with me and helps me deliver my urgent message to the family of God; trust Jesus completely and walk in the liberty and power of the Holy Ghost!"
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc1d",
      "state": "published",
      "name": {
        "given": "Gerald",
        "surname": "Mangun",
        "prefix": "Rev.",
        "additional": [
          "A"
        ]
      },
      "ootfYearInducted": 2004,
      "dateOfBirth": "1919-01-01",
      "dateOfDeath": "2010-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Mangun_Gerald.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Mangun_Gerald.jpg",
        "biography": "In 1921, when Gerald Mangun was only two years old, five Apostolic preachers came to Lapaz, Indiana, and his mother and father heard the Pentecostal message for the first time. The seed of the gospel found fertile soil. His parents were baptized in Jesus' name and received the Holy Ghost.\n \nIn 1927, at the age of eight, he attended Mattie Crawford’s Miracle Healing Revival in Mishawaka, Indiana, and was baptized in St. Joseph's River in the name of Jesus. In that revival, his sister, dying of diphtheria, was instantly healed. This made a lasting impression on him.\n   \nIn 1940 he received the Holy Ghost baptism in a revival in Kokomo, Indiana. Since that momentous day, he has continued steadfastly in the apostles’ doctrine.\n\nDesiring a greater knowledge of the Word, he enrolled in Apostolic Bible Institute (ABI) in St. Paul, Minnesota. He graduated from ABI and was ordained in 1942 by Brother Norris and Brother A. D. Urshan. He accompanied a Bible school classmate, Eldridge Lewis, to McLeod, Texas, borrowing eleven dollars so that he could travel by train. While in the south, he had a mighty revival in Lou-Ann, Arkansas. Occasions to ministry began to open in Indiana and Ohio, then in Louisiana and Texas.\n\nHe had unprecedented fifty-soul and one hundred-soul revivals in small towns in Louisiana: Starks, Clarks, Eros, and Hodge, then traveled to Diboll, Texas, where one hundred souls were saved and baptized in icy waters. It was there he met a preacher’s daughter, young Vesta Layne Gibson, and promptly felt she was the one he would marry. From that revival he traveled to St. Louis for a great revival and then came back to Texas to marry Vesta Layne, September 10, 1943.\n\nTogether, this dedicated couple traveled from state to state for seven years, experiencing great revival and miracles. During an extended fast, he received the call from Brother Pardue to hold a revival in Alexandria, Louisiana. God spoke to him then: “You’ll be the next pastor of the church in Alexandria, and I’m going to give you the city.”\n\nOn July 25, 1950, this word of prophecy began to be fulfilled. G. A. and Vesta Mangun became pastors of the United Pentecostal Church of Alexandria, Louisiana. Since that time, they have led that congregation in prayer, fasting, witnessing, and discipling, with phenomenal growth and expansion.\n\nPrayer was his second nature; he often spent days and nights in prayer.  Even today at eighty-five years of age, he still spends no less than two to four hours a day in prayer, ever pursuing a greater degree of intimacy with Jesus Christ! For more than sixty years, he consistently fasted three days each week and went on a seven-day fast at least once each year until cancer surgery at age eighty made this impossible.\n\nHe served as a Louisiana District presbyter for the United Pentecostal Church for fifty-three years, as a member of the Foreign Missions Board of the UPCI for eighteen years, and as executive presbyter for the United Pentecostal Church International. \n\nFor fifteen years he served as chaplain for the Louisiana State Police and as chaplain for the Parish Sheriff’s Department. He was a longstanding member of the Rapides Parish Airport Authority and a member of Alexandria Port Authority. In March 2002 the Louisiana National Guard presented him with a Civilian Service Medal for his service to the community and nation.\n\nGerald Mangun and his wife, Vesta, raised one son, Anthony Mangun, who married Mickey Lumpkin. They have two grandchildren, Miquell and Gentry, both in the ministry, and one great-grandchild, Eva."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc1e",
      "state": "published",
      "name": {
        "given": "Arthur",
        "surname": "Morgan",
        "prefix": "Rev.",
        "suffix": "Sr.",
        "additional": [
          "T"
        ]
      },
      "ootfYearInducted": 2004,
      "dateOfBirth": "1901-08-27",
      "dateOfDeath": "1967-10-18",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Morgan_Arthur.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Morgan_Arthur.jpg",
        "biography": "Arthur T. Morgan was born August 27, 1901, in Lufkin, Texas, to Joseph W. and Mary Morgan. In 1907 the Morgans moved to Cravens, Louisiana, where Arthur completed his high school education in nearby De Ridder, Louisiana, in 1918.\n  \nOn August 4, 1922, he was united in marriage to Nell Knight in De Ridder.  Sister Morgan became a great asset to his ministry and a wonderful Bible teacher. During the next nine years, they were blessed with four children: Gloria, Mary, Joseph, and A. T. Jr.  \n\nIn 1916 a young preacher by the name of Oliver F. Fauss came to the area and began preaching the Oneness message, baptism in the name of Jesus, and receiving the gift of the Holy Ghost. The Morgans joined their neighbors to learn more about this new doctrine. It was in one of these meetings that young Arthur Morgan heard the Oneness Pentecostal message for the first time. They bought a Bible and began studying Scripture. The message Brother Oliver Fauss preached had a lasting effect on the entire family and played a great part in their later decision to receive the Pentecostal experience.\n\nIt was about three years later, while employed at the De Ridder Post Office, that young Arthur, finding himself under conviction, began seeking the Lord in earnest and received the wonderful experience of the Holy Ghost two weeks later.   \n\nDuring the years he worked at the post office, he began to feel the call to the ministry. In 1929 he was ordained, and affiliated with the Pentecostal Assemblies of the World. Later Brother Morgan became associated with the Pentecostal Ministerial Alliance. This ministerial alliance became the Pentecostal Church, Incorporated in October, 1932.\n\nIn 1931 Brother Morgan was chosen pastor of the First Pentecostal Church of De Ridder, Louisiana, and held this pastorate for approximately two years. In 1932 Brother and Sister Arthur Morgan moved to Alexandria, Louisiana, accepted the pastorate of a small, struggling work there, and in the next twelve years built it into a strong, flourishing church.\n\nThe twelve years in Alexandria were ended when he moved back to De Ridder, in 1944, and became assistant postmaster. At this time he was also serving as district superintendent of the South Central District of the Pentecostal Church, Incorporated.\n\nIn 1945 Brother Morgan was called to the pastorate of Faith Tabernacle in Port Arthur, Texas. He gave up all civil service work, and devoted his full time to pasturing the church and to the growing district work.\n\nHe served on the General Board of the Pentecostal Church, Incorporated in its meetings with the General Board of the Pentecostal Assemblies of Jesus Christ to consider the possibility of uniting these two large bodies of Oneness Pentecostal people. After several meetings and much discussion, the final agreement was reached in September 1945, at the General Conference in St. Louis, Missouri. Thus was born the United Pentecostal Church.\n\nAfter the Merger Brother Morgan was chosen to serve as district secretary-treasurer of the Texas District. He also served as chairman of the Board of Christian Education, and as a member of the Foreign Missionary Board. Then in 1951, Arthur T. Morgan was chosen as general superintendent.  \n\nArthur T. Morgan passed from this life while presiding over a General Board meeting in Tulsa, Oklahoma, on October 18, 1967."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc1f",
      "state": "published",
      "name": {
        "given": "J",
        "surname": "Pugh",
        "prefix": "Rev.",
        "additional": [
          "T"
        ]
      },
      "ootfYearInducted": 2004,
      "dateOfBirth": "1923-01-01",
      "dateOfDeath": "2010-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Pugh_J.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Pugh_J.jpg",
        "biography": "When J. T. Pugh was sixteen years old, he had begun to feel his call to the ministry and, at age seventeen, he enrolled in Southern Bible and Vocational College located in a rural community ten miles from Cisco, Texas. During three of the four years that he attended college, he was pastor of the church in Gorman, Texas. \n \nIn the winter of 1943, Brother Pugh was ordained as a minister of The Pentecostal Assemblies of Jesus Christ. Upon his ordination, his license was signed by W. T. Witherspoon and S. R. Hanby.\n\nOn August 20, 1944, Brother Pugh was married to Bessie Beryl Halbrooks. She was the first and only girl he ever dated. She bore three wonderful children; Datha Jo, Terry, and Nathanael.  \n\nWhile the Pughs were still in college and Sister Pugh taught school, they pastored briefly in Hillsboro, Texas. During their short pastorate, the attendance tripled. After graduating from Bible school, Brother and Sister Pugh traveled as evangelists for a short time.\n  \nIn 1945 the Pughs were called to pastor in Wichita Falls, Texas. They recalled how on Sunday nights, they would count the money the people had handed them that weekend. If it was more than two dollars and fifty cents, they would walk to a drug store and drink a lime aid. They only bought one drink but asked for two straws. \n\nFrom 1946 to 1948, Brother and Sister Pugh evangelized. They later traveled to West Lake, Louisiana, to reopen a work that had been closed. There, their first child, Datha Jo was born. They only stayed in West Lake one and one half years, but God greatly blessed. Brother and Sister Pugh were able to leave eighty wonderful saints behind, a finished parsonage, and a self-supporting work. \n\nIn 1949, at age twenty-seven, Brother and Sister Pugh moved to Port Arthur, Texas, to pastor The First Pentecostal Church. They lived and ministered there for seventeen years. The Lord raised up a strong congregation, and the Pughs built a new parsonage and a new church building.\n\nIn January 1967 the General Board of the UPCI appointed Brother Pugh to fill the unexpired term of Haskell Yadon, as general Home Missions director. After filling that office for six years, Brother Pugh withdrew from it feeling this to be the will of God. \n\nBrother and Sister Pugh felt it God’s will to go to Odessa, Texas, in 1974, to pastor the First United Pentecostal Church. For nineteen years, they enjoyed revival and growth. During those years, God gave the church a new building with a 1,000-seat auditorium. Also Brother Pugh served the Texico District as their district superintendent."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc20",
      "state": "published",
      "name": {
        "given": "Howard",
        "surname": "Goss",
        "prefix": "Rev.",
        "additional": [
          "A"
        ]
      },
      "ootfYearInducted": 2005,
      "dateOfBirth": "1883-01-01",
      "dateOfDeath": "1964-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Goss_Howard.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Goss_Howard.jpg",
        "biography": "Howard Goss took the Bible literally as his way of life. Brought to the Lord from atheism, for his first two years as a Christian, he soaked his mind in Scripture, reading nothing else. This laid the foundation for the wise and loving leader throughout his sixty years of ministry.\n  \nIn his last Scofield Bible, many key verses in Paul’s epistles are heavily marked, underlined with his favorite red ink, especially those about God’s grace. Maybe because he came right out of atheism, falling fresh into God’s love and grace, he was kept from having any taint of old or inherited religious attitudes or unscriptural doctrinal biases. He was born again, into the liberty in Christ, right from the beginning. \n\nTexas was where his early ministry years began, and he held many tent revivals in Galveston, Alvin, Houston, and other southern Texas towns. \n\nAlthough he chose Texas as his adopted state, he loved to travel on trains. He was personally acquainted with almost all the Pullman porters across the country. Those were the days when the clergy had discounted tickets on all trains. He seldom ate in the dining cars though, carrying his lunches in his suitcase: RyeKrisp crackers, cheeses, salami, and canned Vienna sausages, along with his favorite fruit: apples. His favorite beverage was water, and sometimes milk. \n\nThe passage of Scripture he most often chose as a charge to young ministers who were being ordained into ministry was II Timothy 2:24-25, a portion of which states, “the servant of the Lord must not strive.” His own obedience to these verses was well known but often misunderstood by a few, more aggressive colleagues who enjoyed argument and debate.\n\nHe was never a stingy person but was always giving and compassionate whenever he saw a need with which he could help. Brother and Sister Glass held open house for guests during most of their ministry and married years, since he believed that a bishop must be given to hospitality. More often than not, there would be one or more guests at the dinner table, often occupying the large guest room when the Glasses lived in Toronto. \n\n\nBiography of Howard Archibald Goss (1883-1964)\nby J. L. Hall\n\nHoward A. Goss was the first general superintendent of the United Pentecostal Church (UPC). Converted in 1903, under the ministry of Charles F. Parham, Goss attended Parham’s short-term Bible school in Houston, Texas, in 1905. While riding a train with other Pentecostals in 1906, he received the baptism of the Holy Ghost. In the same year, Parham appointed him to be field supervisor of the Apostolic Faith Movement in Texas.\n\nAfter moral charges were brought against Parham in 1907, Goss separated from Parham and evangelized in Texas, Arkansas, Kansas, Iowa, Illinois, and Missouri, establishing several Pentecostal churches. Goss and E. N. Bell were chiefly responsible for organizing the Assemblies of God (AG) in 1914, and Goss was elected to serve on the first executive presbytery and as the person issuing credentials to ministers in the South and West. E. N. Bell rebaptized Goss in the name of Jesus Christ in 1915. \n\nAfter the division of the Oneness ministers from the AG in 1916, Goss served on the credentials committee of the General Assembly of the Apostolic Assemblies. In 1919 he moved to Canada and established a church in Toronto, Ontario, serving as its pastor until 1937. In the US, Goss was a member of the organizing board of presbyters for the Pentecostal Ministerial Alliance and served as the first chairman of this organization from 1925 to 1932. In 1939 he became the general superintendent of the Pentecostal Church, Incorporated. At the merger that formed the UPC in 1945, Goss became the first general superintendent of the new organization and served until 1951. With his wife, Ethel, Goss wrote The Winds of God (1958), a history of the early years of the Pentecostal revival."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc23",
      "state": "published",
      "name": {
        "given": "Tom",
        "surname": "Tenney",
        "prefix": "Rev.",
        "additional": [
          "F"
        ]
      },
      "ootfYearInducted": 2005,
      "dateOfBirth": "1933-12-06",
      "dateOfDeath": "2018-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Tenney_Tom.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Tenney_Tom.jpg",
        "biography": "Tom Fred was born December 6, 1933, in a home on Pine Street in the city of DeRidder, Louisiana. The summer of 1949, at the age of sixteen, Tom Fred Tenney had an encounter that forever changed his life. Slipping into the back row of the Pentecostal church across the tracks to hear a nun give her personal testimony, he found himself fascinated as the nun spoke for about twenty minutes; then a lady preacher delivered a sermon. He had never heard such preaching. Yet, feeling something he could not escape, he found himself back there the next night. The Holy Spirit was drawing  him, and before school started in the fall, Tom Fred Tenney was a new man in Christ. Almost immediately, he felt called into ministry and service. Opportunities were given for him to speak at youth rallies and fellowship meetings. In 1952 T. F. Tenney was elected Louisiana District youth secretary.\n\nTom Fred Tenney and Thetus Caughron were married in West Monroe, Louisiana on December 27, 1952. They have two children, Tom Gregory and Teri Denise (Spears). They have been blessed with five grandchildren and now two great-grandchildren.\n\nT. F. Tenney was nineteen, and Thetus was eighteen when they were elected to the pastorate of a Home Missions church in Monroe, Louisiana, in February 1953. During their time in Monroe, T. F. Tenney was elected as sectional youth leader. In 1954 he was elected district youth president. He continued in that position until 1960, when he was elected international youth president, a position he held until 1969.\n\nDuring the time T. F. Tenney was Pentecostal Conquerors president, the Bible Quizzing program was launched, a number of youth camps across the country were initiated, and youth conventions were founded. The Conquerors Tread was first published under his leadership.\n\nT. F. Tenney assumed the responsibility of Foreign Missions director in January 1970. That year, Partners in Missions was launched. The School of Missions was begun under his leadership. Short-term evangelistic policies and programs were implemented. Field conferences and regional conferences for missionaries were established. The fields were opened up for more participation from pastors and evangelists to make overseas trips and assist in the work. \n\nIn the latter part of 1975, Pastor George Glass Sr. resigned the church at DeRidder, Louisiana. The church immediately called the Tenneys and asked if they would consider the church. From 1975 to 1978, Thetus and T. F. Tenney served the city of DeRidder, and the people of the First Pentecostal Church. \n\nThe final night of Louisiana Camp Meeting in 1978, C. G. Weeks, who had been the district superintendent for twenty-five years, left the platform and called for an ambulance. By the next day, he had gone to his eternal reward and Louisiana was in need of a leader. T. F. Tenney was elected as the new district superintendent. From that summer day in 1978, through May 1, 2005, the Tenneys served the Louisiana district. He is the bishop emeritus of the Louisiana District and serves as an honorary member of the UPCI General Board."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc24",
      "state": "published",
      "name": {
        "given": "Oliver",
        "surname": "Fauss",
        "prefix": "Rev.",
        "additional": [
          "F"
        ]
      },
      "ootfYearInducted": 2006,
      "dateOfBirth": "1898-05-22",
      "dateOfDeath": "1980-07-08",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Fauss_Oliver.jpg",
        "biography": "Oliver Franklin Fauss was born May 22, 1898, in Gage, a small town in northwestern Oklahoma. His family was converted in a Methodist revival meeting when he was just a boy. Many of his memories of his early days are of prayer meetings, revivals and church services. \n\nAround 1905 or 1906 there was a \"holy-roller\" meeting that was held fifteen miles from their home in Gage. They were curious and traveled the distance by wagon. The \"holy-rollers\" they saw were people who preached and believed this Pentecostal message! Young Oliver Fauss could not forget what he heard and saw in that meeting.\n\nIn March 1911 the Pentecostal message came to Ganado. His mother was the first in the family to receive the Holy Ghost. In September 1911 Oliver received the baptism of the Holy Ghost. A few days later, Oliver’s family moved to Houston, Texas. Once there, they attended church at the now famous Brunner Tabernacle.\n\nWhen O. F. Fauss was seventeen years old, he left home to preach. One of his first brush arbor meetings was in Trinity, Texas, in 1915. He also assisted in and attended many camp meetings and revivals in Texas and Louisiana. \n\nIn the late fall of 1915, Oliver Fauss attended a Bible conference held in Elton, Louisiana, that lasted for several weeks. During this meeting, there was much prayer and study on the New Issue and the Oneness of the Godhead. This New Issue was based upon the baptismal formula in Acts 2:38. Oliver Fauss preserved notes taken from Bible studies during the Elton Bible Conference. The truth of the Word of God had come to light, and the Scripture did not teach a trinity of persons in the Godhead but that the Lord our God was one Lord.\n\nNo one in the South had even heard of or believed this message at this point. Then, on December 19, 1915, O.F. Fauss was baptized in Jesus' Name, along with twelve other workers. Robert LaFleur and Oliver Fauss were the first two to wade into a nearby creek and baptize each other. Brother Fauss then baptized Brother S. L. Wise.\n\nOn July 10, 1916, just before going to service in a brush arbor meeting, Oliver Fauss and Miss Jewel Smith were united in marriage. Brother Fauss received his first license to preach on September 2, 1916, from the General Assembly of the Apostolic Assemblies, signed by Daniel C. O. Operrman and Howard A. Goss. He was ordained by the Pentecostal Assemblies of the World, by Brother L. C. Hall on August 3, 1917. This ordination bears the signatures of J. J. Frazier, G. T. Haywood, and Brother Opperman.\n\nThe first nine years of Brother Fauss ministry were spent almost entirely in the evangelistic field in Texas and Louisiana. Brother and Sister Fauss traveled, preaching and conducting revivals in small towns, communities, sawmill camps, and settlements. \n\nBrother Fauss served as chairman of the Apostolic Church of Jesus Christ for two years. He served as chairman over at least two annual conferences of the Pentecostal Assemblies of Jesus Christ (now the UPCI). In 1924 he founded the Pentecostal Witness and was editor for four years. He remained on the editorial staff until his death. (The Pentecostal Witness later became The Pentecostal Outlook, which later became The Pentecostal Herald). He was a member of the Board of Presbyters of the Pentecostal Assemblies of Jesus Christ from its beginning. He also served as chairman of the South Central Council of the Pentecostal Assemblies of Jesus Christ for four years.\n\nIn 1944 the Pentecostal Church, Incorporated and the Pentecostal Assemblies of Jesus Christ appointed committees of three to meet jointly and take preliminary steps toward effecting a merger. W. T. Witherspoon, S. R. Hanby, and Oliver Fauss were appointed from the Pentecostal Church, Incorporated. As the Merger was finalized several months later, the official name of the organization became the United Pentecostal Church.\n\nAfter the Merger, Brother Fauss held the position of assistant general superintendent from 1947 to 1971. He also served as general superintendent, serving out the unexpired term of A. T. Morgan in 1967. At the 1971 General Conference, he was appointed honorary General Board member and held this position until his death on July 8, 1980.\n\nHe successfully pastored a number of great churches: First Pentecostal Church of Port Arthur, Texas; First Pentecostal Church in Bay City, Texas; Calvary Tabernacle in Indianapolis, Indiana; First Pentecostal Church in Pensacola, Florida; and a church in Newcastle, Indiana. He moved to Houston, Texas, in 1928 with a burden for a work for the name of the Lord."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc25",
      "state": "published",
      "name": {
        "given": "Eunilah",
        "surname": "Mean",
        "prefix": "Rev.",
        "additional": [
          "K"
        ]
      },
      "ootfYearInducted": 2006,
      "dateOfBirth": "1926-01-01",
      "dateOfDeath": "2007-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Mean_Eunilah.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Mean_Eunilah.jpg",
        "biography": "While just a child living along a yellow-clay road near Roodhouse, Illinois, Eunilah K. (Rutledge) Mean received her Pentecostal experience.  There were but few that had turned their lives over to the newfound apostolic experience at that time, so she did not have a large circle of fellowship. Nilah found the secret of daily spending quality time in the presence of God by an old stump nearby to their home. She would brush away the ants and kneel in precious times of communion. At the age of eighteen, she was active full time in the work of evangelism.\n  \nA few years had passed when Sister Charlotte, a twenty-two-year-old nun, came to Nilah's service in Davenport, Iowa, and was drawn to the altar by the powerful, anointed preaching. Sister Charlotte joined Sister Nilah soon after, giving her testimony each night preceding the preaching of the Word. They did this for fourteen years.  \n\nIn July 1952 Sister Nilah preached a series of revival services as the first church of Apostolic faith was opened in the province of Nova Scotia. This pattern followed for the next five years, resulting in four new churches being established. Sister Nilah Rutledge was ordained at the 1952 General Conference in Little Rock, Arkansas.\n\nIn 1957 Nilah married a young man, John, that worked with her in the opening of those churches. Along with Sister Charlotte, they traveled across the US holding revival services. In 1959 she returned to Nova Scotia and opened a new church in Amherst. She preached the first revival services in the opening of two other churches in Middleton and Dartmouth. She stayed in Dartmouth and pastored a growing congregation for some thirty years. Doubtless, thousands will walk the streets of gold because of her loyal, consistent, and positive approach."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc22",
      "state": "published",
      "name": {
        "given": "Harry",
        "surname": "Scism",
        "prefix": "Rev.",
        "additional": [
          "E"
        ]
      },
      "ootfYearInducted": 2005,
      "dateOfBirth": "1934-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Scism_Harry.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Scism_Harry.jpg",
        "biography": "While Ellis and Marjorie Scism were attending the Bible Training Center in Oakland, California, Harry Ellis Scism (named after Harry Morse) was born on March 9, 1934.\n\nAfter living in Tieton, Washington, where Harry’s only sister, Ferne, was born, the family moved to Idaho. Harry was baptized in Jesus' name at nine years of age. The family eventually made Oregon their home. Ellis and Marjorie had felt a burden for India for over fourteen years. They were given missionary appointment and plans were made to travel to India. Thankfully, Harry received the baptism of the Holy Ghost after an all-night prayer meeting in Bend, Oregon, before leaving for India. \n \nOn January 30, 1949, Harry, at fourteen years of age, along with his mom, dad, and sister, Ferne, waved goodbye to their family and friends from the deck of the China Mail, not knowing when they would meet again. The sea voyage of two months took them to many ports in six nations and finally to Madras, India, by the end of March. Harry arrived in India at fifteen years of age to begin a new and very different life.\n\nHarry was placed in a boarding school in Kodaikanal, South India.\nAfter completing high school at nineteen years of age, Harry, who had already become involved in missionary work when going to the plains during the school holidays, was appointed as an assistant missionary. As a licensed minister with the United Pentecostal Church and as an appointed missionary, his work began in 1953. \n\nFollowing two years of missionary work, Harry, with his family, returned to the US for furlough in l955. He had planned to spend four to five years in Bible college and secular college. At the beginning of the first year attending Conquerors Bible College in Portland, in prayer he felt he should return to India at the conclusion of the first year of study. At the conclusion of the school year, Harry married Audrene Hruza, from Rupert, Idaho. Their honeymoon was spent traveling on deputation.\n\nIn October 1956, they began working in the Bible school in South India. Here their first child, Stanley, was born. They felt the need to evangelize and plant churches in North India. At last, they made the long 2000-mile trip by jeep to language school, where they studied the Hindi and Urdu languages.\n\nIn time, they were able to open churches in North Central India. The Lord blessed them with a daughter, Loretta. They founded Calvary Bible Institute, which over the years has trained hundreds for the Northeast harvest.\n\nEventually, Harry and family moved to Manila, Philippines, as this was a central location for the region and travel was easier. Travel was extensive and expensive, so he, with his family, arrived in Portland at midnight from Hong Kong, in January 1976, to raise more support.\n\nBrother Scism received a call from Robert McFarland, general secretary of the UPC, explaining that with T. F. Tenney’s resignation as general Foreign Missions director, the General Board had appointed Harry to fill the unexpired term. He then asked, “Will you accept this appointment?” Robert McFarland explained that he had to have an answer within two hours. Harry and Audrene moved to St. Louis in May 1976, where many adjustments had to be made. \n\nAfter two years of sickness with cancer, Audrene passed away in October 1989. Missionaries and constituents all over the world loved her. The staff at the office was so kind and patient as Harry struggled with grief and heartache.\n\nOn December 8, 1990, Harry Scism and Helen Stewart of Columbus, Ohio, were united in marriage. Helen has been a wonderful wife and has traveled extensively around the world in missionary work. \n\nFor twenty-five years, Brother Scism was privileged to serve as general director. He traveled all over the world meeting precious people everywhere he went. Harry and Helen are now appointed missionaries traveling to different parts of the world in teaching and evangelism."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc26",
      "state": "published",
      "name": {
        "given": "John",
        "surname": "Mean",
        "prefix": "Rev.",
        "additional": [
          "D"
        ]
      },
      "ootfYearInducted": 2006,
      "dateOfBirth": "1932-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Mean_John.jpg",
        "biography": "The call of God came upon John D. Mean when he was very young. He lived in a country area of Windsor, New Brunswick, with no opportunity to attend high school. Knowing that due to his young age he was not eligible to enter Bible school, he asked for a meeting with the principal, Reverend S. G. Steeves, who was also serving as the first district superintendent of the district of New Brunswick in 1947, just one year after a former full gospel church group had joined the United Pentecostal Church. After this meeting, Brother Steeves asked John Mean to attend the Bible school. After John graduated from the Emmanuel Bible School in 1950, he pastored his home church for a time, then continued in evangelism.\n\nIn 1952, along with the Lewis DeMerchant family, John Mean came to Stewiacke, Nova Scotia, to open the first Apostolic Church in that province. The \"Nilah and Charlotte Evangelistic Team” came to preach the first meetings. Twenty-eight were baptized in the precious name of Jesus Christ during six weeks of revival meetings. The following year he prepared the way for those noted evangelists to crusade in the town of Trenton, where they were threatened with stoning. However, God wrought great victory, and another church was planted.  \n\nIn 1953 they preached the first revival as a new church was opened in the town of Truro. In 1954 John came to Halifax with the same evangelistic team, and another church was founded. After three years in Halifax, he and Sister Nilah Rutledge married and visited many churches in the US, holding revival services for two years. In 1959 they returned to Nova Scotia and opened another church in Amherst, then returned to Halifax the following summer. After returning to Halifax, God helped them to build two other churches in Middleton and Dartmouth, Nova Scotia.\n\nBrother Mean served in the district offices of youth president and Home Missions director and served as district superintendent for twenty-six years. He recently retired from the pastorate of the Halifax assembly after approximately forty-eight years. He and Sister Mean visited the missionary fields in Peru, Brazil, El Salvador, Guatemala, Pakistan, Wales, and Germany, and they also had the great experience of attending the World Conference in Jerusalem."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc27",
      "state": "published",
      "name": {
        "given": "Jesse",
        "surname": "Williams",
        "prefix": "Rev.",
        "suffix": "Jr.",
        "additional": [
          "F"
        ]
      },
      "ootfYearInducted": 2006,
      "dateOfBirth": "1927-08-03",
      "dateOfDeath": "2014-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Williams_Jesse.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Williams_Jesse.jpg",
        "biography": "Jesse Franklin Williams Jr. was born on August 3, 1927, in the coastal town of Wilmington, North Carolina. His father was a building contractor, and his mother, Anne, was a seamstress. Though they were not really a family of faith, young Jesse was sent to a Baptist Sunday school through his early years. But at the tender age of sixteen, providentially, he encountered the apostolic message. He was baptized in Jesus' name and received the Holy Ghost in 1943. \n\nFeeling his call and beginning to preach, Brother Williams received his first ministerial license with the Church of the Lord Jesus Christ in 1945. Drafted into the United States Army at the end of World War II, he served as a medic and x-ray technician with the Occupation Forces in Japan, 1946–47, and upon discharge married his sixteen-year-old sweetheart, Sue Collins. Back in civilian life and beginning his family, he continued to work as an x-ray technician from 1947 to 1951, during which time his sons, C. Patton and Michael Jesse, were born.\n\nTrained in engineering, Brother Williams was employed by the Babcock & Wilcox Company in 1951, served in management there until 1965, and taught evening classes as a part-time instructor at a local community college. Having affiliated with the Assemblies of the Lord Jesus Christ at its inception, he served as assistant pastor in his home church during those years.\n\nIn December 1965, now the father of four, two sons and two daughters, Sue Ann and Fay Elizabeth, life took an extraordinary turn, when Brother and Sister Williams left family and friends to plant a church in Fayetteville, North Carolina. He became a member of the United Pentecostal Church in January 1966, and a new era began.\n\nA bi-vocational Home Missionary pastor, he was employed as plant engineer for Hercules Steel Company until he left their employment and became a member of their Board of Directors in 1972. Plunging into the work of what was then an emerging district, Brother Williams served North Carolina as Sunday school director, then district superintendent.\n\nVarious tenures as an executive presbyter, assistant general superintendent, and chairman of the Urshan Graduate School of Theology Board have marked his forty-one years of service to the United Pentecostal Church International."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc29",
      "state": "published",
      "name": {
        "given": "Lowell",
        "surname": "Benson",
        "prefix": "Rev.",
        "additional": [
          "H"
        ]
      },
      "ootfYearInducted": 2007,
      "dateOfBirth": "1915-11-01",
      "dateOfDeath": "2008-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Benson_Lowell.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Benson_Lowell.jpg",
        "biography": "Born the youngest of three children, Lowell Howard Benson arrived November 1, 1915, in Della Plain, Arkansas, to Jim and Pearl Benson. Lowell’s young life was rocked with tragedy in a series of events while he was still just a toddler. His father abandoned the family, leaving his mother with total responsibility for care. Shortly after, she was diagnosed with cancer and died on Lowell’s third birthday.\n\nThe three children immediately went to live with their grandparents, and the family soon relocated to Pocahontas, Arkansas. As soon as he was old enough, he began to help his two sisters on the farm. As a young teen, Lowell discovered that his grandmother had also been diagnosed with cancer. By the time he was fifteen, she knew she could no longer care for him and sent him to live with his oldest sister who was now married and living in St. Louis, Missouri.\n\nOne afternoon while visiting his sister in St. Louis, Lowell entered a store-front revival where he gave his heart and life to Christ. Soon he learned that an old friend from Arkansas was now pastoring a church in nearby Granite City, Illinois. So at age seventeen, he left the life he knew with his sister to live with Brother and Sister Odell Cagle. The Cagles took Lowell into their home with open arms, waking Lowell each morning at 5 a.m. for prayer meeting. About a year after his arrival, the Cagles began to evangelize and hold tent meetings in various states.\n\nOn November 24, 1934, Lowell Benson married Nina Elizabeth King. From the very moment they said I do, the adventure began. For not only had they married each other, they formed a partnership that would join their hearts and efforts together to work for God and grow His Kingdom. The Bensons moved to Fort Dodge, Iowa, with the Cagles to pioneer a new work. Brother Benson soon started preaching revivals and evangelizing all over the country.\n\nIn the summer of 1935, he took his first pastorate in Darden, Tennessee. Fall brought the couple a special gift with the birth of their daughter, Peggy. God called the Bensons to several other works during those early years and gave them a son, Jim, in 1940. Some of Lowell’s endeavors include: pastoring Henry County Tabernacle (Tennessee); pioneering works in Sheffield and Stevenson, Alabama; pastoring in Pritchard, Alabama; and serving as district superintendent of Alabama during the early 1950s.\n\nAfter working in Alabama for several years, Lowell and Nina felt God leading them back to Tennessee. In 1953 they moved to Oak Ridge to assist in a new work. Over the next ten years they pastored the West Nashville Church and pioneered a new work in Lawrenceburg, Tennessee. Brother Benson also served the Tennessee district as Sunday school superintendent.\n\nIn May 1963 the Bensons opened a new work in East Nashville, reaching out to a community that most had forgotten. They faced many hardships and strong opposition, but continued in the work to which they knew God had called them. In the spring of 1979, he was elected district superintendent for the state of Tennessee, and he served faithfully in that position for seventeen years."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc2a",
      "state": "published",
      "name": {
        "given": "Ralph",
        "surname": "Cook",
        "prefix": "Rev.",
        "additional": [
          "G"
        ]
      },
      "ootfYearInducted": 2007,
      "dateOfBirth": "1899-09-01",
      "dateOfDeath": "1981-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Cook_Ralph.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Cook_Ralph.jpg",
        "biography": "Born to immigrant parents from Northern Ireland and England on September 1, 1899, R. G. Cook entered the world in Boston, Massachusetts. \n\nIn the midst of a gathering at Trinity Pentecostal mission, the Holy Ghost fell on him and he began to speak with tongues. He immediately began to feel the call of God for ministry and began by witnessing and participating in street meetings. \n\nAt nineteen years old, he met and married a dedicated young lady. It was during the terrible years of an influenza epidemic that swept the eastern United States following World War I that his young wife died along with their new baby girl just one year into their union. \n\nIt was during this period that R. G. Cook received the revelation of the Oneness of God and baptism in Jesus' name. He began to travel and speak in small meetings across the United States. His travels reached to the southern states and into the Midwest. During his travels in 1921, he met a young woman evangelist named Nelly Jane Reppond from Louisiana. They married and began holding revival meetings throughout Illinois, Missouri, and Arkansas. In 1922 at the age of twenty-two, they were named pastors of an assembly in Little Rock, Arkansas, that is still a United Pentecostal Church today. After just one year there, they returned to found a church in the Boston area.\n\nFinding a few believers, they opened a work in Foxboro, Massachusetts. For many years this was the only organized Jesus' Name work in all of New England. While pastoring this work for more than twenty years, he also traveled throughout New England, particularly Maine and New Brunswick, preaching camp meetings and helping emerging works. \n\nIn 1945, S. R. Hanby invited Brother Cook to pastor a church that he had founded in Lancaster, Ohio. Brother Cook led this church for twenty-eight years. \n\nR. G. Cook served in many official capacities in organizations throughout his years of ministry. He was a district elder with the Pentecostal Assemblies of the World. He also served in that role with the Pentecostal Assemblies of Jesus Christ prior to the merger in 1944. When the United Pentecostal Church International was formed in 1945, he was elected as the first district superintendent of the Ohio District and served ten years. He was appointed to the Foreign Mission Board of the UPCI and served nine years until he was elected as the UPCI assistant general superintendent from the Eastern Zone.\n\nHe retired in 1972 from his pastorate and from the office of assistant general superintendent. He continued to travel and minister until the time of his death at age eighty-two."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc2b",
      "state": "published",
      "name": {
        "given": "Fred",
        "surname": "Kinzie",
        "prefix": "Rev.",
        "additional": [
          "E"
        ]
      },
      "ootfYearInducted": 2007,
      "dateOfBirth": "1914-02-04",
      "dateOfDeath": "2009-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Kinzie_Fred.jpg",
        "biography": "Frederick E. Kinzie was born to Mr. and Mrs. William Kinzie on February 4, 1914. When he was five years old, his family moved to a farm near Lapaz, Indiana. There, playing with the next door neighborhood kids, Fred met Vera Berger, who later became his wife. They both graduated from Lapaz High School and in 1934 were married.\n\nFred and Vera began life together as farmers, fully expecting to farm for the rest of their lives. In 1936 things dramatically changed when they yielded their lives to the Lord Jesus Christ and received the baptism of the Holy Ghost. They became active in the Plymouth, Indiana, Old Time Religion Tabernacle pastored by Walter D. Mangun. Brother Kinzie became an elder, and Sister Kinzie ministered as a musician in the church. During that time he was superintendent of a non-denominational Sunday school for three years. \n\nIn 1941 Brother Kinzie felt the call to the ministry. In the winter of 1944, the Kinzies took time off from the farm to help Evangelist Earl Gamblin, preaching and singing in meetings in Miami and Pensacola, Florida. Suddenly, rheumatic fever began its throbbing pain in Brother Kinzie while he was driving between the two cities, and he ended up in a hospital in Pensacola, Florida. Finally, in earnest prayer he committed himself to the ministry. That day, Vera wrote letters home informing their folks that they were leaving the farm. The next morning, Brother Kinzie was a healed man. \n\nTwo months later in July 1944, Brother and Sister Kinzie began evangelizing. Pat and Pam McQueen went with them, making a musical team. They sang, preached, and were known as the Kinzie Evangelistic Party throughout the United States and Canada. The group traveled for the next nine years. In 1950, another member was added to the party with the birth of their daughter, Cassandra. \n\nBrother and Sister Kinzie were honored to be a part of the Merger conference in 1945.\n\nMany opportunities to pastor churches in states from California to Florida were offered Brother Kinzie while traveling, but the Lord impressed him to \"keep on doing what you're doing.\" His call to Toledo was so definite that doubts never crossed their minds. They arrived in that city in May 1953 and they helped build three church buildings during their pastorate. \n\nThirty years later Brother Kinzie turned the church over to his son-in-law, J. Mark Jordan and family. Brother Kinzie serves as pastor emeritus.\n\nAfter retiring, Fred Kinzie began writing. Four books were published by Word Aflame Press and many articles printed in the Pentecostal Herald and district magazines.\n\nOn December 16, 2006, Sister Kinzie went on to meet the Lord."
      }
    },
    {
      "id": "5ba9310960053b1ba7db2670",
      "state": "published",
      "name": {
        "given": "O",
        "surname": "Crabtree",
        "prefix": "Rev.",
        "additional": [
          "C"
        ]
      },
      "ootfYearInducted": 2018,
      "dateOfBirth": "1922-01-01",
      "dateOfDeath": "1997-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Crabtree_O.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Crabtree_O.jpg",
        "biography": "Reverend Orville Clay Crabtree was born in 1922 in a log cabin in Mt. Pisgah, Kentucky. His family moved to New Castle, Indiana, where Brother Crabtree was baptized in Jesus’ name and received the Holy Ghost in 1938. He preached his first sermon at the young age of seventeen. He wed the pastor’s daughter, Bobbie McElhaney, in 1942. During his senior year at Apostolic Bible Institute (ABI), Brother Crabtree was asked by S. G. Norris to pastor the church in Red Wing, Minnesota. Brother Norris felt that, as a pastor, Brother Crabtree needed to have ministerial license, and he was ordained before even holding a General license. W. T. Witherspoon signed his ordination credentials.\n\nIn 1947 Brother Crabtree was elected pastor of the First Pentecostal Church of Panama City, Florida. The church had been formed through the evangelistic efforts of D. L. Welch, and under the solid leadership of Brother and Sister Crabtree, the church saw tremendous growth. Brother Crabtree’s thirty-five years of pastoral leadership laid a foundation of sound, biblical teaching for the church. \n\nBrother Crabtree served the Florida District in many capacities. He used to joke that he had held every office but Ladies Auxiliary president. As youth president, he was the principal of the first UPCI youth camp in Florida. Brother Crabtree also served as editor of the district magazine, sectional presbyter, and district secretary. In 1982 he was elected superintendent of the Florida District. While District Superintendent, O. C. Crabtree was elected pastor of the First Pentecostal Church of Wewahitchka, Florida, in 1994.  \n\nO. C. Crabtree served on the General Board from 1982 until his passing in 1997 and was often called upon by N. A. Urshan to give devotions and serve on special committees. He was a renowned Bible teacher, an expert in Bible prophecy, and a camp and conference preacher. He was loved for his ability to apply Scripture in a very practical manner, and his sermons are still remembered by many. \n\nBrother Crabtree celebrated his heavenly birthday on his natural seventy-fifth birthday, October 3, 1997. His wife, Bobbie, survives him and she is an active member of the First Pentecostal Church in Panama City. At the age of ninety-five, she still drives herself to and from church. \n\nHe is also survived by two children, three grandchildren, and eight great-grandchildren. His son, Reverend Allen Crabtree, and his wife, Denise, pastor the First Pentecostal Church in Panama City, Florida. His daughter, Barbara Abernathy, and her husband, Bryan, serve in UPCI Global Missions.\n\nHis grandson, Shane Crabtree, and his family are members of Atlanta West Pentecostal Church in Atlanta, Georgia. His granddaughter, Shawna Hobson, and her husband, Bill, serve in UPCI North American Missions and are members of The Sanctuary in Hazelwood, Missouri. His granddaughter, Shannon Crabtree, and her family are members of the First Pentecostal Church in Panama City, Florida. Brother Crabtree did not live to see his eight great-grandchildren, but his legacy lives on in them; all but the youngest have been baptized in Jesus’ name, and all have received the gift of the Holy Ghost."
      }
    },
    {
      "id": "5ba9323b60053b1ba7db2673",
      "state": "published",
      "name": {
        "given": "Gerald",
        "surname": "Vittitow",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2018,
      "dateOfBirth": "1939-01-19",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Vittitow_Gerald.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Vittitow_Gerald.jpg",
        "biography": "Gerald L. Vittitow was born in a tar paper shack in Nelsonville, Kentucky, on January 19, 1939, to Pentecostal, sharecropper parents, Willard and Helen Vittitow. His dad would get cardboard boxes to tack on the inside walls to keep cold air out. While the Vittitow family was attending Greater Bethel Apostolic Church, a Pentecostal Assemblies of the World congregation, Gerald was baptized in Jesus’ name at age six. He received the Holy Ghost at age twelve, during a revival with Chester Aldridge.\n\nIn 1957, at the age of eighteen, Brother Vittitow felt the call of God to preach. Shortly thereafter, Brother Vittitow joined the Air Force Reserves and was assigned to Michigan. Every weekend he would drive more than two hours each way to attend church in Bay City. After he relocated to Bay City to work with Pastor James Silvernale, he was introduced to the pretty accordion player, Joyce Arhutick, who he married a year later, on July 29, 1961.\n\nWhile working for General Electric, Gerald assisted W. E. Davis in Louisville for a time, and received his Local ministerial license in 1963. He received his General license two years later, and then assisted J. D. Langford until 1967, when he was elected pastor of Calvary Apostolic Church in Louisville, Kentucky. Gerald and Joyce’s son, Kevin, was born in 1968 and their daughter, Keri, was born in 1971. Under Brother Vittitow’s leadership over the next forty years, the church grew from under one hundred to over 450 in attendance. During his pastorate, twenty men in the church received ministerial license and some of those men established new churches in Kentucky, Indiana, Georgia, Tennessee, and Michigan. \n\nBrother Vittitow also served as youth secretary, youth president, district secretary, and district superintendent of the Kentucky District. He was instrumental in locating, purchasing, and developing a campground for the Kentucky District. His wife, Joyce, served as secretary and president of Kentucky District Ladies Ministries from 1963 to 1997. Gerald Vittitow has served the UPCI as presiding officer for judicial procedures and as a member of the General Board. He served as an executive member of the Tupelo Children’s Mansion Board for many years. \n\nPresently, Brother Vittitow is an honorary member of the Tupelo Children’s Mansion Board, the Kentucky District Board, and the General Board. Since retirement in 2007, the Vittitows have faithfully attended the First United Pentecostal Church in LaGrange, Kentucky. In his later years, Brother Vittitow’s faithfulness and love of the work of God continues as he is committed to the work in LaGrange."
      }
    },
    {
      "id": "5ba9382560053b1ba7db2674",
      "state": "published",
      "name": {
        "given": "Norman",
        "surname": "Paslay II",
        "prefix": "Rev.",
        "additional": [
          "R"
        ]
      },
      "ootfYearInducted": 2018,
      "dateOfBirth": "1957-03-26",
      "dateOfDeath": "2018-03-24",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Paslay II_Norman.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Paslay II_Norman.jpg",
        "biography": "Norman Russell Paslay II was born in Cincinnati, Ohio, on March 26, 1957, the only child of Norman and MaryAlice Paslay. Raised by godly Pentecostal pioneers, his early life was spent in tandem with their ministries. When Norman was eleven years old, his parents founded The Calvary Church in Cincinnati.\n\nAfter surrendering to the call of God, Norman attended Apostolic Bible Institute (ABI) in St. Paul, Minnesota. In 1977 he married Jeannie Simmons, whom he affectionately called “the brunette,” and they returned to Cincinnati that year to begin working with Norman’s parents at The Calvary Church. Norman was ordained by the United Pentecostal Church International (UPCI) in 1980.\n\nNorman faithfully served The Calvary Church as youth pastor from 1977 to 1992, and as senior pastor from 1992 until his death on March 24, 2018. Humorous and transformational preaching and an unending love for people were hallmarks of his leadership. He spent countless hours connecting with the congregation and community through counseling, personal Bible studies, and by simply being present at their celebrations and in their difficulties. He impacted the Cincinnati region as a police chaplain, and he was the first UPCI minister to become an FBI chaplain.\n\nNorman Paslay served the Ohio District as youth secretary for one year and as youth president for fourteen years. He preached over one hundred youth camps throughout the US. He discipled hundreds of young people for thousands of hours while serving as a Bible quiz coach from 1981 to 2018. During that time his teams won eleven national championships, and he was selected as coach of the year three times.\n\nReverend Norman Paslay II served the UPCI as director of Media Missions, helping to innovate ways of broadcasting the gospel and to establish My Hope Radio. Norman was a member of the Global Missions Board from 2006 to 2017; during that time he helped raised over $203,000 in monthly support for missionaries and participated in the creation and promotion of the I AM GLOBAL offering. He also served on the Ministers Appeal Council. Norman was on several church and educational boards, including ABI, Urshan Graduate School of Theology, and Purpose Institute. \n\nPastor Paslay facilitated Jonathan Ministries, designed to support young ministers with their practical financial needs. He wanted the next generation to know that he trusted them. “Trusted,” was the title of the message that Norman Paslay preached at the 2017 Ohio District Camp Meeting. It was the first and only message he would preach as the Ohio District UPCI Superintendent, but it would encapsulate the message of his life.\n\nNorman and Jeannie had four beautiful daughters, and he applied the same principles of investment and intentionality seen elsewhere in his life and ministry with his family. “I want to be remembered for the way I did family,” he said. His daughters, sons-in-law, and grandchildren continue his legacy of investing in people and the kingdom of God. His son-in-law and daughter, Tom and Kristen Ellis, now serve as pastors of The Calvary Church."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc2c",
      "state": "published",
      "name": {
        "given": "O",
        "surname": "Williams",
        "prefix": "Rev.",
        "additional": [
          "W"
        ]
      },
      "ootfYearInducted": 2007,
      "dateOfBirth": "1919-05-03",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Williams_O.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Williams_O.jpg",
        "biography": "O. W. Williams was born May 3, 1919. He was the thirteenth of fourteen children born to Wesley and Ida Shepherd Williams in the hills of Tennessee. \n  \nAs a teenager, he met and married Violet Lynch. God blessed them with sixty-seven years and nine months of marriage before He took Violet home to be with Him. He also blessed them with three beautiful daughters: Virginia, Laverne, and Demi. On September 23, 2005, Brother Williams married Doris Gary. \n\nIn 1940 at the age of twenty-one, Brother Williams and his family attended service at a one-room school house. There he wept and repented of his sins. In Cane Creek, Brother Stubblefield baptized him in the lovely name of Jesus Christ. After that, the Williams family started attending a community service at a place called Upper Sinking. During this revival, God filled him with the Holy Ghost.\n\nNext, the Williams moved to Nashville, then on to Memphis, where they became members of the First Pentecostal Church with Pastor E.E. McNatt.\n\nDuring the first decade of Brother Williams’ ministry, three churches were started in Tennessee.  In 1945, in Ridgely, Tennessee, he was given approval to take the church to a building that had been vacant for some time. Brother Greer, with funds provided by one of his friends, bought the building, and there Brother Williams began his pastoral responsibilities. Later a building became available in Tiptonville, a few miles away, and he began to preach there also.  \n\nNear the end of Brother Williams’ time in Ridgely, God began to deal with him about Union City, some thirty-one miles away. He experienced many challenges in building the church in Union City. However, God always had a plan. Brother Williams’s faith was being built through each obstacle.\n\nWhile in Tennessee, O. W. Williams was elected to several district offices, including presbyter. In 1953 he felt the call to go to Kilgore, Texas, and accepted the pastorate there. He served in Kilgore for six years before moving to Houston. In Houston a church was built that seated 1,100 people.\n\nFor fourteen years the Williams labored at Stonewall, until the fellow brethren of Texas elected him to the office of district superintendent. It was during his tenure that the current tabernacle on the campgrounds in Lufkin, Texas, was built.\n\nBrother Williams served as superintendent for three terms. At the end of the third term, he felt a call back to pastoral ministry. In December 1976 he assumed the pastorate of Eastview United Pentecostal Church in Lufkin."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc2d",
      "state": "published",
      "name": {
        "given": "Jack",
        "surname": "Yonts",
        "prefix": "Rev.",
        "additional": [
          "E"
        ]
      },
      "ootfYearInducted": 2007,
      "dateOfBirth": "1928-03-28",
      "dateOfDeath": "2014-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Yonts_Jack.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Yonts_Jack.jpg",
        "biography": "Jack was born March 28, 1928, and spent his early life in Herrin, a small mining town in southern Illinois. He was the youngest of five children (three boys and two girls). When he was ten years old, he moved with his parents, Raymond and Della Yonts, to Glendale, Illinois. His father, Raymond, pastured a small church in this town. Four years later the family relocated to Indiana. At that time Jack went to live with his uncle and aunt, T. J. and Loraine Miller, who pastored a thriving church in Muncie, Indiana. \n\nIn 1945 Jack accompanied his aunt and uncle who were moving to Toledo, Ohio, in order to pastor a small church. In the fall of 1947, he enrolled as a student at Apostolic Bible Institute (ABI) in St. Paul, Minnesota. While attending ABI, God called Jack into the ministry. He was nineteen years old.\n\nJack Yonts and Jo Ann Whitaker married in July 1948. She became the love of his life and his life partner in ministry. They raised a beautiful family of four children (three girls and one boy).\n\nThe young couple began to travel, conducting revivals for two years. By 1953 they were ready to settle in one place, and began a Home Missions church in Connersville, Indiana. They labored there for two years, and then moved to Muncie, to serve as assistant pastor.\n\nIn 1955 Jack became the pastor of the Pentecostal church in Hartford City. He served the congregation for seven years until the fall of 1962. He served as district youth secretary (1955–60) and as district Home Missions director (1960–62).  \n\nThe family moved again in the fall of 1962. This move took them from Indiana to Madison, Wisconsin, where they pastored for nine and a half years. Brother Yonts served as district Home Missions director for one year and as district secretary for eight years. Significantly, it was here where his passion for reaching the lost and clear understanding of the needs of home missionaries birthed Christmas for Christ, in December 1963.\n\nThe spring of 1971 took the family to Appleton, Wisconsin. Impassioned with the ministry of Jesus Christ, they began a Home Missions church in their home. Beginning with just their family members, the work grew to become a revival church with a congregation of up to 200 during the six and a half years they labored there. While in Appleton Brother Yonts served as regional Home Missions director for two years and as district superintendent for four years.\n\nAt the 1977 General Conference, Jack Yonts was elected as general Home Missions director. During his sixteen years in that role, New York Metro District was birthed and he served as its superintendent for six years during its development. Also the Central Canadian District was formed and he served as its district superintendent for three years. \n\nJack Yonts oversaw the first Black Conference in Houston and the first Spanish Conference in New York, both held in 1978. Additionally, the first National Growth Conference was held in St. Louis. Metro evangelism was clearly the heartbeat of his burden and administration. Numerous metro missionaries were selected and supported, and the home Bible study, a simple and effective soul-winning tool, was promoted across the US and Canada. He was also a significant participant in the development of the home Bible study, Exploring God’s Word.\n\nAs Jack approached the age of sixty-five, God called the Yonts to the great mission field that is Chicago-metro. Armed with prayer, dedication, and the simple Word of God, Jack and Jo Ann once again started a church in their home using the home Bible study, Exploring God’s Word.\n\nJack Edwards Yonts Sr. has been a part of the Executive Board for sixteen years and the General Board for thirty-three years (thirteen of those years as an honorary member). He has authored a two-volume multimedia teaching series, Passing the Mantle."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc2e",
      "state": "published",
      "name": {
        "given": "Arless",
        "surname": "Glass",
        "prefix": "Rev.",
        "additional": [
          "R"
        ]
      },
      "ootfYearInducted": 2008,
      "dateOfBirth": "1929-08-17",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Glass_Arless.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Glass_Arless.jpg",
        "biography": "Arless Richie was born to Robert N. and Allie Glass on August 17, 1929, in DeRidder, Louisiana. At birth the doctor said that he could not live, so they placed him in a dresser drawer and left him. Soon a close neighbor was allowed in the room, and she asked, “Where is the boy?” Their answer was, “In the dresser drawer; he’s dead, or dying.” The neighbor took Arless from the drawer, detecting life, gave him to a nurse and said, “Take care of him! God has a great work for him to do!”\n\nAt age eleven he went to work at the Realart Theater. Upon graduating from high school, Arless was promised a football scholarship. He hitchhiked to the college and was about to enter the registration office when a voice spoke to him: “Why not wait until the spring semester to enroll?” The voice was so strong he turned and walked out and the first car that passed gave him a ride home. Before the spring semester, God filled him with the Holy Ghost.\n\nAfter joining the Air Force on his twenty-first birthday, Brother Glass was stationed at Craig AFB, Alabama. Deployed to Okinawa for two years, he baptized ninety-five people in the wonderful name of Jesus. After coming back to the states, Arless married Geraldine (Geri) Gill June 16, 1953. They became the parents of three children, Cathy, Letha, and Rich, and were blessed with six grandchildren. After forty-two years of wonderful marriage, Geri died of cancer.\n\nTwo years later Arless married JoAnn Cannon, widow of Reverend Clyde Cannon. JoAnn was the Ladies Ministries president of the Louisiana District. Arless inherited another daughter, Becky Davis. After six years JoAnn passed away from a heart attack.\n\nTwo years later Arless married Joan Carouthers, widow of Reverend Kelton Carouthers, adding another son and daughter, Mark Carouthers and Karen Jenkins.\n\nStationed in Alabama in 1951, an ice storm prevented Brother Glass from meeting the District Board. They mailed him his local license, and in July 1953, he was ordained at the Louisiana Camp Meeting. On October 16, 1953, Brother Glass was discharged, drove home, unloaded the car, disconnected the trailer, repacked, and left the next day to go to Alexandria, Louisiana, to begin revival. He also earned a Bachelor of Theology degree from Texas Bible College (TBC).\n\nIn November 1956 the Glasses accepted the pastorate of the UPC of LaMarque, Texas. After nearly six years, God spoke to Arless and said, “I want you in Pasadena.” For forty-six years, he has remained in the city of his calling. \n\nHe has been involved in many programs and offices: Sunday school director of the Houston section; one of the founders of TBC; district Foreign Missions director; regional Home Missions director; Evangelism Commission; member of the TBC Board of Directors; TBC instructor; Lt. Col. CAP, auxiliary, USAF; police chaplain in the Pasadena Police Department; superintendent of education, endorsing agent for Military chaplains; founder of the UPCI Chaplaincy program; organizer of the Association of Christian Teachers and Schools (K–12); one of the founders of Urshan Graduate School of Theology. He also received an honorary doctorate in Pentecostal Studies from Apostolic Bible Institute; received a master’s diploma in Apostolic Studies; served as a member of the Texas District Board, the South Texas District Board, the General Board, and the Board of Education; was a member of many committees, both district and national; assisted in rewriting the Judicial Procedure; was listed in Who’s Who in 1978 and Who’s Who of Executives and Professionals in 2007; and was chosen by Who’s Who to be one of the ten professionals to be featured on their web page at no cost."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc2f",
      "state": "published",
      "name": {
        "given": "J",
        "surname": "Hall",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2008,
      "dateOfBirth": "1933-01-01",
      "dateOfDeath": "2011-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Hall_J.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Hall_J.jpg",
        "biography": "Over the past forty years, J. L. Hall has been a leader in the United Pentecostal Church International. He has well served the Apostolic movement as a teacher, pastor, preacher, editor, writer, district superintendent, theologian, and historian.  \n  \nDuring his tenure as editor in chief, the Pentecostal Herald proclaimed the Apostolic message worldwide, and the Forward provided valuable resources for ministers. The selection of Word Aflame Press books grew from a mere handful to over 150 in print on a variety of biblical, ministerial, and practical subjects. He actively supervised the approval and editing of all periodicals, tracts, books, and Sunday school literature. He was also instrumental in organizing the first Oneness Pentecostal symposium, overseeing the Historical Center (now the Center for the Study of Oneness Pentecostalism), formulating the Judicial Procedure, and chairing the Parliamentary Committee.\n\nBrother J. L. Hall is widely respected both inside and outside the Oneness Pentecostal movement as one of its foremost theologians and historians. He contributed several articles for The New International Dictionary of the Pentecostal and Charismatic Movements (2002), including the one on the UPCI, and is the only living Oneness leader to be the subject of an article in it. Often, as an insightful General Board member, he has played a key role in dealing with theological issues, constitutional and judicial matters, and difficult decisions in our movement. Leaders have valued his advice as sound, unbiased, and uninfluenced by personal agendas. He is a kind, gracious, steadfast, and articulate spokesman for the Apostolic faith.\n\nWith an uncompromising faith in the Word of God, Brother J. L. Hall has constantly challenged the modern Pentecostal movement to follow its natural impulse of biblical understanding in doctrine and experience. Brother J. L. Hall and his lovely wife, Margie, were married for over fifty-six years. Brother and Sister Hall’s sons, Gerald and Ron, are UPCI pastors in Michigan, and their daughter, Diana, with her husband, Warren, lives in Scottsdale, Arizona."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc30",
      "state": "published",
      "name": {
        "given": "F",
        "surname": "McKenzie",
        "prefix": "Rev.",
        "additional": [
          "Wesley"
        ]
      },
      "ootfYearInducted": 2008,
      "dateOfBirth": "1929-09-22",
      "dateOfDeath": "2003-03-03",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_McKenzie_F.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_McKenzie_F.jpg",
        "biography": "F. Wesley McKenzie was born in Jamaica, West Indies, on September 22, 1929. He attended public school there, and was raised in a local denominational church. However, he longed for more of God than he found there. He left home in 1949, to seek employment in Kingston, the capital city.\n\nArriving in Kingston, he discovered that the cousin to whose home he had come had recently obeyed the truth, so it was not long before Wesley followed his example. He was baptized in Jesus' name and received the Holy Ghost under the ministry of Reverend Ralph Reynolds at Pentecostal Tabernacle on Wildman Street in Kingston.\n\nIn 1955 he married Margherita Hunt, who was also a member of Pentecostal Tabernacle. This union produced four children: Granville, Desmond, Elise and Heather. Brother McKenzie was always a lover of education, and his desire to pursue higher education led him to migrate to Toronto, Canada, with his family in 1967. They attended First United Pentecostal Church and all four children were born again there, during the pastorate of Reverend Carl Stephenson.  \n\nIn 1971 a job transfer made it necessary for the family to move to a small town west of Toronto. Their first visit was to Weston UPC, located in the west end of Toronto. The main prayer request that day was for a new pastor, as their current pastor had accepted a position elsewhere. Up to the time of his departure, no replacement had been found, so the church board asked Brother McKenzie if he would consent to being the regular Sunday morning speaker, which he did. After some months, with still no pastoral applicants, the board suggested to the district superintendent, Reverend J. O. Moore, that he ask Brother McKenzie to consider applying for a local license and becoming the pastor of the church. He prayed about it and finally agreed.  \n\nFollowing what he felt to be the direction of the Holy Spirit, Brother McKenzie spearheaded two sessions of the “Enroll to Grow” Sunday school outreach program. The result was an urgent need for relocation, as the congregation grew to 120 in a building that seated ninety-six! A nearby movie theatre came up for sale, and the Lord moved miraculously in various ways to allow the church to purchase this building in 1985. As the church continued to grow, the need for another relocation became evident in 1997, and God, again by many miracles, provided the present location at 1901 Jane Street. Preparing for the move, the church felt the need for a new name that would more accurately reflect its character, experience, and history. Faith Sanctuary was chosen. \n\nPastor McKenzie was ordained to the ministry in July 1979. He taught courses part time for several years at Apostolic Missionary Institute and was a member of the Ontario District Board from 1992 until his death. He also served on the Editorial Board of the UPCI and on the Ministers Appeal Council. He travelled to the mission fields of Brazil and the Philippines and ministered in several other places. He was a great believer in spreading the gospel through daughter works, and this policy still continues today at Faith Sanctuary. One of Pastor McKenzie’s fondest dreams was for the church to own a senior citizens residence, and this desire was fulfilled as part of the deal for the present property.\n\nOn the morning of March 3, 2003, after a four year battle with cancer, Brother Kenzie passed from this life."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc31",
      "state": "published",
      "name": {
        "given": "Oscar",
        "surname": "Vouga",
        "prefix": "Rev."
      },
      "ootfYearInducted": 2008,
      "dateOfBirth": "1903-06-29",
      "dateOfDeath": "1978-08-08",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Vouga_Oscar.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Vouga_Oscar.jpg",
        "biography": "Oscar Vouga was born June 29, 1903, and passed from this life on August 8, 1978, in Macon, Georgia. On July 3, 1924, he met and later married Ruth.\n  \nHe was a missionary, evangelist, pastor, and able administrator, who served in diverse capacities in the interests of our Apostolic fellowship. At the time of the merger of the bodies that constitute the United Pentecostal Church International, he was a valued member of the Pentecostal Church Inc.   \n\nHis ministry began in the mid-1920s right after he received the Holy Ghost. Brother and Sister Vouga were in Hawaii in 1926, as the first Apostolic Pentecostal missionaries to Hawaii—over thirty years before Hawaii became a state. Brother Vouga served four years as a missionary to Hawaii, taught in Bible school, and evangelized and pastored in many areas of the United States and Canada. \n\nBrother Vouga established a solid church during his stay in Winnipeg, with many families sharing in his very competent ministry. It was while he was in Winnipeg that he was elected to the office of assistant general superintendent, and he left shortly after to take up residence in Indianapolis, Indiana. He later moved to Pritchard, Alabama, where he pastored for seven years before moving to St. Louis to assume the responsibilities of the Foreign Missions director of the UPC.\n\nHis was one of the strong voices that helped to establish the gospel message that we love and appreciate today. Uncompromisingly, he proclaimed the truths of the mighty God in Christ, the New Birth, holiness of life, and other subjects vital to the Christian life that are found in the Word of the Lord. He served the church of Jesus Christ unselfishly, giving himself unreservedly to any and every phase of the work he was engaged in.  \n\nThe last thirty-three years of his ministry were given to the constituency of the United Pentecostal Church International. He also served as an honorary member of the General Board.\n\nAt the time of his death, he was pastor of a lovely church in Macon, Georgia. He preached in that church just a few days before his passing. His vigorous presentation of the Word of God, under a heavy anointing of the Spirit, was no less than it had been over the many years of his outstanding ministry."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc32",
      "state": "published",
      "name": {
        "given": "R",
        "surname": "Whalen",
        "prefix": "Rev.",
        "additional": [
          "D"
        ]
      },
      "ootfYearInducted": 2008,
      "dateOfBirth": "1930-05-02",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Whalen_R.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Whalen_R.jpg",
        "biography": "On May 2, 1930, Robert Daniel was born to Martin and Josephine Whalen at their home in Columbus, Ohio. His father was a staunch Roman Catholic and his mother simply a Protestant with no religious affiliation.  \n \nWhen “Bobby” was three months old, his mother received the Acts 2:38 experience, much to his father’s dismay. However, a year and a half later, his father was baptized in Jesus' name and filled with the Holy Ghost, speaking with other tongues. They attended the Apostolic Gospel Church pastored by W.T. Witherspoon.\n\nRobert Whalen was privileged to grow up under the dynamic teaching and preaching of his much loved and respected Pop Witherspoon. When he was eleven years old, he gave his first Bible study during a daily Vacation Bible School. At the age of twelve, he was baptized in water and at the age of fourteen was baptized with the Holy Ghost.\n\nIn October 1948 Brother Whalen enrolled in the Apostolic Bible Institute, where he again sat under a master teacher, Brother S. G. Norris. It was here he met Gerry Kelly, the love of his life, and they were married by Brother Norris on August 5, 1950. They graduated together in 1951 but remained in St. Paul another year for Brother Whalen to take a post-graduate course. During that year their first child, Sally Jean, was born on December 16, 1951.\n\nIn the fall of 1951, he received his first license with the UPC, a general license through the Ohio District, signed by General Superintendent Howard Goss, Assistant General Superintendent Oscar Vouga, General Secretary Stanley Chambers, and Ohio Superintendent Ralph G. Cook.\n\nIn the spring of 1952, after much prayer, he moved his little family to Ohio, while waiting on God to open a door—but every door closed. After preaching a few revivals and weekend services and doing odd jobs, he attended the General Conference in Little Rock, Arkansas. There, he was introduced to Brother C. A. Nelson, Oklahoma District Superintendent, who immediately said, I have a church for you in Oklahoma. Very reluctantly, Brother Whalen agreed to preach for the little Home Missions church in Ardmore. That weekend the Lord miraculously let him know without a shadow of a doubt that this was to be his field of labor. The Whalens moved to Ardmore in November 1952. He was ordained into the ministry at the Oklahoma District Conference in Claremore in March 1954 by Assistant General Superintendent Oliver F. Fauss.  \n\nWhile in Ardmore, two more children were born to the Whalens: Patricia Lea on December 5, l954, and Robert Stuart on July 2, 1958. When their baby boy was just four days old, Oklahoma Superintendent M. D. Deal called to tell Brother Whalen he had been unanimously elected pastor of the Southeast UPC in Oklahoma City. Having the assurance that this was the will of God, they began their pastorate in Oklahoma City in August 1958, and continued there until retiring January 1, 1996.\n\nAt their first sectional conference R.D. Whalen was elected to a sectional office and thereafter almost continually held an office. He served as sectional youth secretary and youth leader, then district youth secretary. In 1962 he was elected district presbyter, continuing in this office until elected district superintendent in 1983. He remained superintendent for eighteen years until he retired in 2001.\n\nBefore becoming district superintendent, Brother Whalen was the first elected executive presbyter of the South Central Region in 1977, at the General Conference in Indianapolis.  \n\nSince 1983, he has been on the Tupelo Children’s Mansion Board of Directors, serving as vice-chairman of the board during Brother James Lumpkin’s tenure as chairman. Although now retired from most positions, he is honored and humbled to be pastor emeritus of his former congregation, now the Southern Oaks UPC of Oklahoma City, and to be an honorary member of both the Oklahoma District Board and the General Board of the UPCI."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc33",
      "state": "published",
      "name": {
        "given": "Thomas",
        "surname": "Craft",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2009,
      "dateOfBirth": "1931-12-30",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Craft_Thomas.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Craft_Thomas.jpg",
        "biography": "Tommy Lynn was born on October 30, 1931, in Anacoco, Louisiana. The Great Depression was in full swing and at the age of three his family moved to Pecos County, Texas and helped pioneer the oil field and build the West Texas town of Iran. \n  \nHe began school at the age of six in Iran, Texas. When he was nine years old, Pearl Harbor was bombed, and they moved back to Anacoco.\n\nWhen he was thirteen, Tommy Lynn preached his first sermonette under a tent that Reverend W. E. Gamblin had set up in Anacoco. J. J. Hennigan was his pastor, mentor and friend. He began to mature under Brother Hennigan’s leadership. \n\nUpon completion of high school, he was awarded the very prestigious honor of the Legislative Scholarship to Louisiana State University, all expenses paid. He turned this honor down because of his desire to be involved in the work of God. Instead, he attended International Bible College in San Antonio, Texas, for two years. That school went into the so-called Latter Rain movement, so he transferred to Apostolic Bible College and graduated in 1953.\n\nThe first church he pioneered was in Iran, Texas. He baptized converts in the Pecos River. He was secretary of the Youth Department and preached revivals all over West Texas, New Mexico, and Colorado. \n\nAt the age of twenty-four, Brother Craft returned to Louisiana. He fell in love and married Mary Francis Smith, a charter member of the Pentecostals of Alexandria, on August 25th, 1956.\n\nAfter evangelizing for a few years, God directed him to go to St. Francisville, Louisiana, and build a church. They rented the American Legion Hall and started building a congregation and a church building. While pastoring, he served as Youth President of the Louisiana District. \n\nIn the late 1950s, Brother and Sister Craft preached a nine-week revival in Jackson, Mississippi, where Reverend W. E. Gamblin was the pastor. Sherri Layne, the Crafts first child, was born August 20, 1958. In January of 1962, Brother Gamblin called to see if the Crafts would pray about moving to Jackson. \n\nTwo weeks before they moved to Jackson, their second child, Vonda Lynn, was born. They relocated to Jackson on July 29, 1962. The sixties was a marvelous time for revival. The church quickly filled to capacity and beyond. \n\nSherri is married to Reverend Mark Grisham and Vonda is married to Reverend Chris Tharp. Brother and Sister Craft have four granddaughters, one grandson, and three great grandchildren. \n\nA new Colonial style church was built at 3425 Robinson Road in 1970. It wasn’t long until it was full. Then God gave an even bigger challenge to Brother Craft. He had attended the funeral of Reverend Clyde Haney and the Lord spoke to him about reaching His world from one place. The desire to train young men and women began to grow in his heart. Little did he realize God was preparing his future for Jackson College of Ministries. \n\nProceeding JCM, an event occurred that changed the apostolic landscape. Brother Craft and Brother Kenneth Phillips were directed by God to have a Preaching and Prayer Conference. By word of mouth, over 250 preachers attended this conference. For three nights and two days they preached and prayed. What a dynamic move of God! The next year they had around 900 preachers who attended what they then called Deeper Life Conference. Conferences broke out all over the UPCI fellowship and to this day there are many similar conferences being held.\n\nLocal Music Conferences began in Jackson. An Evangelism Commission was begun after Deeper Life Conferences.\n\nMissions, foreign missions in particular, has been his soul’s sincere desire. He has preached around the world twice, going east to west then west to east preaching crusades in many countries. He would be gone many weeks at a time and come home to a church having revival. Many great revivals began overseas with these crusades. \n\nPentecostal Bible Institute in Tupelo, Mississippi, moved to the Mississippi campgrounds in Raymond. Brother Craft purchased the charter and began Jackson College of Ministries in 1976. The college moved from the campgrounds to a facility in North West Jackson. This was the first Bible College to offer five different degrees: Theology, Missions, Music, Christian Education and Religious Studies. He remained President of JCM until 1997."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc34",
      "state": "published",
      "name": {
        "given": "Fred",
        "surname": "Foster",
        "prefix": "Rev.",
        "additional": [
          "J"
        ]
      },
      "ootfYearInducted": 2009,
      "dateOfBirth": "1926-12-28",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Foster_Fred.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Foster_Fred.jpg",
        "biography": "Freddie Jean Foster was born December 28, 1926. His Father and Mother were John Wesley and Ruby Foster. His younger and formative years took place in Durham Community, Rodger Mills County. The tough and devastating Dust Bowl and the Great Depression caused the family to move to the North Valley-Albuquerque, New Mexico in 1936.\n\nAt the age of sixteen, Fred joined the US Navy. He served aboard the minesweeper USS Vigilance. Fred left the ship then for Military Government School at the Presidio, in Monterey, CA. \n\nWhile going to the University of New Mexico in Albuquerque and participating in the athletic program, Fred and his future wife, Pat, came to God the same night, April 1948, in the pastorate of W.H. Massengale during an A.W. Hicks revival. Fred, feeling a call to preach, transferred to Pentecostal Bible Institute (PBI) in Tupelo, Mississippi.\n\nPBI summer school students, 1949, held a brush arbor meeting. After two weeks they were going to close it down, so Fred and another student decided to continue with many coming to God. They resolved to start a church. Pat joined in this endeavor after their marriage on September 10, 1949. This was the beginning of Cedar Grove Pentecostal Church. Brother and Sister Foster went back and preached the 50th Anniversary.\n\nIn September 1954, the Fosters founded Calvary Pentecostal Church. While there, Brother Foster felt the call of God to begin a Bible college in the Texas District where he had never ministered. \n\nIn 1958, the Fosters became pastor of the Orange, Texas, Border Street Church (now First United Pentecostal Church). Sizable growth and a Saturday Bible School for area preachers were developed. Brother and Sister Foster went back and preached both the 75th and 85th anniversaries of the Orange Church.\n\nBrother Foster was founding president of Texas Bible College and it was a phenomenal success from its beginning. \n\nBrother and Sister Foster and their family were elected pastor of First Pentecostal Church, West Monroe, Louisiana in January 1970. The Fosters made sure the church was UPCI all the way, by the church giving liberally to all departments, district and international.\n\nAfter relinquishing the pastorate to his son Mark, Brother Foster redirected to other works of ministry; writing, speaking, etc. He was also challenged by his three years at Jackson College of Ministries, and enjoyed the presidency of that college.\n\nIn 1965, Fred Foster and Edwin Judd became the first General Conference Parliamentarians at Grand Rapids, Michigan. \n\nThe Foster’s children serve UPCI pastorates: Mark, West Monroe, Louisiana; Tom, Dallas, Texas; and Debbie and her pastor husband, Steve Saiz, Torrance, California. They have one deceased son, Tim."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc35",
      "state": "published",
      "name": {
        "given": "Clyde",
        "surname": "Haney",
        "prefix": "Rev.",
        "additional": [
          "J"
        ]
      },
      "ootfYearInducted": 2009,
      "dateOfBirth": "1912-05-14",
      "dateOfDeath": "1971-10-14",
      "details": {
        "biography": "Born into the passionately Christian family of Levi and Sophie Haney on May 14, 1912, Clyde was the third child to come into this union. His mother had received the Holy Ghost a few years before his birth, and by the time he joined them, the family, along with Brother Harry Morse, had followed the revelation of the Oneness of God and Jesus Name baptism. \n\nWhen Harry Morse moved to begin a work in Oakland, California, Clyde’s father, Levi Haney, took over the leadership of the work in Stockton. This church, along with a group of churches that came together, experienced unprecedented revival in 1921.\n\nWhen Clyde was fourteen, his father decided to leave the family. At this time, Clyde was very pleased when the chance came to work with his sister and brother-in-law on their ranch up in the foothills above Stockton. \n\nWhen Clyde became ill, the doctor’s dire prediction was that he was going to die and that no doctor or medicine could help him.  It was then Clyde surrendered his life completely and totally to Jesus Christ and he was instantly healed. He began to follow the Lord with a sincere desire to minister in some effective way.\n\nIn 1933, he met Olive Gray, whose parents were dedicated missionaries to the country of Japan. She had traveled to Stockton, to further her Christian training. Married in July of 1934, their family was complete when several years later, four children were added one by one to the circle; Kenneth, Shirley, Evangeline and Joleane. \n\nIn their early married life and during the depression years, Clyde and Olive traveled from Arizona, to Missouri, and back, helping churches and pastors along the way, while sacrificing themselves at every turn. \n\nUpon returning to Stockton, they worked seasonally picking fruit and also helped in the church, Harmony Chapel, pastored by Brother Van Buskirk. Feeling the need for more formal education, they moved to Oakland, California, to attend Pentecostal Training School led by Harry Morse. Determined not to waste this opportunity, it was here that Clyde Haney learned the value of ministerial and Biblical training. \n\nIn 1938, after moving his family to the foothills to be closer to his work, Clyde got a job building roads and was soon asked to be the preacher at a small community church in the nearby gold mining town of Paloma, California. Although they eventually moved back to Stockton to resume helping Brother Van Buskirk, they faithfully continued to visit and hold services for the group in Paloma. \n\nIn 1940, feeling the leading of the Lord, they moved to Pasadena to not only pastor the people there, but to also experience great growth and erect a new building during wartime when it seemed impossible to do so. That church is still standing today. \n\nHowever, it seemed that Brother Haney’s home, Stockton, was to be his destination as six years later he was summoned by telegram to return and take the work there. He pastored there for twenty-five years, built two more church sanctuaries, two Sunday school wings and an overflow building on site. \n\nBrother Haney founded a Bible College in 1949, in the basement of the Harding Way Church. Over time, he built nine buildings to facilitate it. In its sixty years of existence, over 6,000 students have passed through the doors of what was first known as Pentecostal Bible School, and then was later christened Western Apostolic Bible College. Today this institution still stands and is known as Christian Life College. \n\nAdding a high school and eventually an elementary school, he worked hard overseeing and assisting in the construction of a total of fifteen buildings during his ministry. His devout service record included a stint as Youth Director of the Western District of the UPCI, and he founded the first Western District Youth Convention held in Carlsbad, CA. He capably filled the roles of assistant pastor, evangelist, pastor to three fine churches, and Bible College founder and president. \n\nClyde Haney passed from this life on October 14, 1971, at the age of fifty-nine, following a tragic automobile accident while hunting. His memorial service was held in the final church he built on Cherokee Road in Stockton. \n\nOnce again, he made the trip to the foothills he loved so much. Such fitting surroundings for this man with an inherited pioneering spirit, whose life and teachings helped to strengthen and ground this great organization, the United Pentecostal Church International."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc36",
      "state": "published",
      "name": {
        "given": "Stuart",
        "surname": "Norris",
        "prefix": "Rev.",
        "additional": [
          "G"
        ]
      },
      "ootfYearInducted": 2009,
      "dateOfBirth": "1901-07-16",
      "dateOfDeath": "1990-01-01",
      "details": {
        "biography": "On July 16, 1901, at Royalton, Ohio, Frank and Susan Norris had their only child, Stuart Greene. In high school he fell in love with vivacious Jessie Dunn. Their romance continued into college and they were married in 1923.  He enrolled in Ohio State University, majoring in Business Administration, working nights at the Western Union.\n\nDrawing on his sales experience, he joined the National Cash Register Co. Soon he became the branch manager. While under the pastorate of W. T. Witherspoon, Brother Norris became a preacher and developed a great love for the Word of God.\n\nThe Norrises had five children: James, Mary, David, Eleanor and Ruth. Life was wonderful. \n\nAfter moving to New York City, he established a church there. He gained spiritual strength that lasted a lifetime.\n\nHe was commissioned by Reverend Witherspoon to pastor the church in St. Paul, Minnesota. This church had fourteen previous pastors. Into this atmosphere, he moved his family to 464 Pierce St, St. Paul, Minnesota, in 1934. \n\nOctober 1, 1937, Apostolic Bible Institute began. It was housed at Midway Tabernacle, the church he pastored. The foundation of this school was the Word of God. Invincible biblical truths were placed in the lives of students.\n\nTheir faithfulness led to growth. God opened the doors at new locations for Midway Tabernacle and the ABI before miraculously providing the present campus at 6944 Hudson Boulevard. Reverend Norris pastored Midway Tabernacle and officiated as the ABI president and simultaneously served as the Superintendent of the then North Central District. Later his responsibilities also included serving on the board of the UPCI.\n\nHe published the former Pentecostal Outlook, and wrote inspired doctrinal tracts: Gospels, Acts and Epistles, The Mighty God in Christ and others. \n\nHe also developed detailed Bible charts of the Tabernacle Plan and the Book of Revelation. These were designed in large sizes (approximately 12x 24) and required a series of studies."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc37",
      "state": "published",
      "name": {
        "given": "Janet",
        "surname": "Trout",
        "prefix": "Rev."
      },
      "ootfYearInducted": 2009,
      "dateOfBirth": "1937-10-06",
      "details": {
        "biography": "Janet Varnado was born in Lincoln County, Mississippi, on October 6, 1937, to A.D. and Bessie Varnado. She was the sixth and youngest child. \n\nShe recognized the voice of the Lord and at the age of thirteen in Dequincy, Louisiana, she received her call to preach the Gospel. She was licensed by the Louisiana District Board in July 1955, by Superintendent C.G. Weeks\n\nAs a fully appointed missionary to the island of Jamaica, she and her parents arrived on January 23, 1956. Her Dad was the pastor of Pentecostal Tabernacle and Superintendent of the United Pentecostal Church of Jamaica. Her Mom was the Bible school teacher. She was the evangelist and also served as an assistant to her Dad. During their tenure on the island, thirteen church buildings were built in eleven years. \n\nWayne Trout and Janet were married in August 1958, by Brother Howard Goss. For the next two years, they pastored the growing church in Wilmington, Delaware. In 1960, they started driving one hour south to hold Bible studies in the home of John and Ruby Hopkins.\n\nThey resigned the Wilmington Church and moved to Dover, on April 17, 1961. Their son, Anthony, was ten months old. For a year, they rented a VFW Hall and then in 1961, they bought property and built the first building; it was finished and dedicated on Thanksgiving 1961. On July 1, 1964, their daughter, Jeanette, was born.\n\nIn 1965, there were two families driving the long distance to Dover from Oxford, Pennsylvania, on Sunday. This led the Trouts to start Bible studies in the home of Emma Carter in October 1965. The Bible study attendance grew and they rented a Grange Hall to accommodate the growing church. When they outgrew those facilities they moved to the Bayview Council Hall to have space for Sunday School classes. \n\nThe church grew and they bought property and built a church in the town of North East, Maryland, on Route 40, in 1972. They have enlarged the building twice and built a large Family Life Center adjacent to the church.\n\nIn 1967, the Dover church congregation had grown and they bought three acres of property north of Dover. Here, they built the second building and dedicated it on Thanksgiving 1968. Later, an educational building was added to the structure. In 1975, with an urgency to provide a Christian education for the church children, Kent Christian Academy was founded with 105 students the first year. \n\nDuring the Bible college years, The VIEW (Video International Evangelizing the World) program was developed as a Biblical training tool that continues today as the core curriculum for Bible schools around the world. In 2005, Sister Trout was a major player in the establishment of the International Biblical Institute in Jerusalem and Jordan.\n\nIn 1995, Brother and Sister Trout resigned from the Dover church and their son, Anthony, was elected Pastor. The church has since built a new building and continues to grow under Pastor Anthony’s leadership. Brother and Sister Trout continue to pastor the North East, Maryland church.\n\nIn December 1998, Sister Trout started Bible studies in Georgetown, Delaware. The first building there was bought in 1999. After the renovations were complete, it was put on the market and sold. The church rented for three years and then bought a second property with the proceeds from the sale of the first property. \n\nBrother and Sister Trout have written and recorded over 75 songs and Sister Trout has written eight books. \n\nBrother Trout served as District Superintendent for the New Jersey Delaware District for twenty-five years. He currently serves as an honorary board member on both the district and national boards of the United Pentecostal Church. Sister Trout serves as the Home Missions Director for the New Jersey-Delaware District UPCI and the National Director of the Amish-Mennonite Ministry. She is the Treasurer of the Board of Trustees and a founding board member for Urshan Graduate School of Theology.\n\nIn recognition of high scholastic achievement, Sister Trout was inducted into the Sigma Beta Delta, the International Honor Society in Business, Management, and Administration by Wilmington University with a 4.0 GPA."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc38",
      "state": "published",
      "name": {
        "given": "Wayne",
        "surname": "Trout",
        "prefix": "Rev."
      },
      "ootfYearInducted": 2009,
      "dateOfBirth": "1933-01-30",
      "dateOfDeath": "2019-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Trout_Wayne.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Trout_Wayne.jpg",
        "biography": "Wayne Trout was born on January 30, 1933 in the rolling hills of Lancaster County, Pennsylvania near the small community of Georgetown. Raised on a farm, he learned how to work hard at a young age. He walked one and a half miles to the Presbyterian Church on Sunday where he received an eight-year award for perfect attendance. \n\nAt age sixteen, living in a boarding house, he met a young man who invited him to church. They went to the Broad Street Pentecostal Church in Oxford, Pennsylvania, where he was baptized in Jesus name by Pastor Edward Brack. Brother Trout attended Pentecostal Bible Institute (PBI) in Tupelo for one year. \n\nAt the age of nineteen, Brother Trout received his call from the Lord; he wanted to start a church. He was determined to do the will of God in his life. There were those who said he was too young or that it was impossible, but none of it discouraged him.\n\nHe established the first Jesus name work in the State of Delaware in 1952--the Gospel Light Tabernacle of Wilmington. They started by renting a building; the mission at 2nd and Adams Street in downtown Wilmington. The same church building still stands and has a thriving congregation to this day.\n\nWayne Trout served as Youth President for the Eastern District of the United Pentecostal Church which at that time consisted of the states of New York, Connecticut, New Jersey, Pennsylvania, and Delaware. He started an outreach in Salem, New Jersey."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc39",
      "state": "published",
      "name": {
        "given": "Charles",
        "surname": "Grisham",
        "prefix": "Rev.",
        "additional": [
          "R"
        ]
      },
      "ootfYearInducted": 2010,
      "dateOfBirth": "1930-12-16",
      "dateOfDeath": "2015-01-01",
      "details": {
        "biography": "Charles R. Grisham was born December 16, 1930.  He married Frances, on October 16, 1948, and out of that union came six children: Terry Lynn Grisham Bass, Lorna Kathleen Grisham Danvers (who died in 1995), Mark Anthony Grisham, Cheryl Denise Grisham Becton, Gregory Brent Grisham, and Daren Shane Grisham. Also, there are ten grandchildren and five great-grandchildren. \n\nBrother Grisham was called to the ministry during the mid-fifties and has served in various capacities over the years in the church as well as the business world. These experiences include time served as an evangelist, associate pastor, and pastor. He later was elected to the Executive Board of the UPCI, as well as presbyter on the district board in the Michigan District.\n\nIn 1975, the Grishams moved to Hammond, Indiana.  From there it was on to Fargo, North Dakota, where they pioneered their first home missions endeavor in their living room.  He also became a pioneer missionary in the Great Plains development program of the UPCI. Brother Grisham was invited to come to World Evangelism Center and served two years as Home Missions Outreach Director.\n\nIn 1975, the Grishams made yet one more move to assume the pastorate of New Life Apostolic Church in Detroit, Michigan, where they remained some thirty-one years until retirement.\n\nBrother Grisham helped to develop training materials on marriage and family, and young minister’s seminars.  He wrote many articles and booklets that have been a blessing through the years.\n\nIn 2002, Brother Grisham suffered multiple strokes.  After more strokes in 2008, and three heart attacks in 2009, this couple is still together and much in love.  The Lord has spared his life and he and Sister Grisham are enjoying quiet, yet deeply spiritual, times in their home and at their daughter and son-in-law, Ron Becton’s, church in West Nashville, Tennessee."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc3a",
      "state": "published",
      "name": {
        "given": "V",
        "surname": "Guidroz",
        "prefix": "Rev.",
        "additional": [
          "A"
        ]
      },
      "ootfYearInducted": 2010,
      "dateOfBirth": "1906-10-06",
      "details": {
        "biography": "Vily Guidroz was born October 6, 1906, in Louisa, Louisiana, of very humble beginnings.  Reared as a Methodist in the lower Louisiana swamplands, his godly mother guided his spiritual journey. He received the Holy Ghost and was baptized in Jesus' name at age fifteen and began preaching at age seventeen.\n \nBrother Vily, as he was called, married a beautiful, gospel worker and school teacher, Dora Emily Raggio. Vily and Dora had nine children, six daughters and three sons: Glory, Grace, Billye, Faith, Judy, and Wanda, Vily Arlen, Ronald Leslie, and Lowell David. All three sons became UPCI ministers. Three of his grandsons, Eldredge Guidroz, Kerry Hammer, and Lucky Guidroz, are also licensed with the UPCI.\n \nHe was ordained by the Pentecostal Assemblies of the World on October 15, 1926, at approximately twenty years of age and later joined the Pentecostal Ministerial Alliance. \n\nBrother Guidroz joined the Pentecostal Assemblies of Jesus Christ in 1931. He pushed for the merger of the Pentecostal Church Incorporated and the Pentecostal Assemblies of Jesus Christ and he was present at the United Pentecostal Church Incorporated merger conference in 1945. Brother Guidroz was elected Texas District superintendent in 1952, and served for over nineteen years, until 1972.\n \nBrother Guidroz provided much of the inspiration for the purchase and development of the Texas District Camp Ground, which is now dedicated to his memory. \n  \nIn his early years, he traveled widely in evangelistic ministry, especially serving a ''circuit'' of churches in the Northern States.  \n\nHis most notable revival was an outdoor meeting in Leesville, Louisiana, in 1928. The whole city turned out and over 200 received the Holy Ghost. He was the Founding Superintendent of Texas Bible College, and developed it into a formidable training center for ministers.\n \nAfter serving as pastor of several churches in Louisiana and Texas, he founded Peace Tabernacle at Goose Creek, Texas, which is now Baytown.\n \nAbove all, Vily Able Guidroz was a preacher of never-to-be-forgotten sermons. He spent many days at courthouses to hear presentations from lawyers in order to better learn how to communicate. \n \nWhile Brother Guidroz was preaching a revival for A. D. Urshan in New York City, the young Columbia University student, Nathaniel Urshan, gave his heart to God and received the Baptism of the Holy Ghost.\n\nHe was a motivated and driven man; a man who never lost sight of the road ahead and he won his race."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc3b",
      "state": "published",
      "name": {
        "given": "Kenneth",
        "surname": "Haney",
        "prefix": "Rev.",
        "additional": [
          "F"
        ]
      },
      "ootfYearInducted": 2010,
      "dateOfBirth": "1937-07-18",
      "dateOfDeath": "2011-01-01",
      "details": {
        "biography": "On July 18, 1937, Kenneth was born to the parents of Reverend Clyde and Olive Haney in Stockton, California.  At the young age of seven, he received the gift of the Holy Ghost and was baptized in Jesus name. \n\nAt age twelve, he received the call to preach at a service conducted by Ruby Keyes at the Bend, Oregon, camp meeting where his father was the Bible Teacher for the day services. At age fifteen, he preached his first message in a church, and at age seventeen, he received his ministerial license with the United Pentecostal Church International.  He was ordained June 19, 1959. \n\nIn the earlier years of his ministry, he served as Associate Pastor with his father for eleven years at the First Pentecostal Church in Stockton, as well as traveled for WABC, recruiting students in the summer, and preaching revivals and singing.\n\nKenneth Haney and Joy McDonald married October 14, 1961, and to this union were born five children: Sherrie, Nathaniel, Stephenie, Elizabeth, and Angela. All five children are serving the Lord and are involved in ministry. \n\nAs a young man, he was involved in organizational work.  In 1963, at the age of twenty-five, he was elected Western District Youth President and served in this office for seven years. In 1963 and also 1964, he received the first place award from the Western District as being first in the nation for Sheaves for Christ giving. Under his leadership the Western District was the first district to have Bible Quizzing.\n\nIn 1969, he was elected UPCI National Youth President.  While serving in this capacity he started several programs.  They were: The Youth Redemption Center (a place for troubled youth with drug problems), Pentecostal Student Fellowship International- (Campus Ministry), IYC, and the magazine, HOMELIFE, for young married couples. He was elected for two terms in this office, but upon the untimely death of his father and at the request of the church board, and after much prayer and deliberation, he resigned and returned to Stockton, where he was elected pastor. At the same time, he also became President of Western Apostolic Bible College, which during his time of service there, the name of the church was changed to Christian Life Center and the college to Christian Life College\n\nDuring his early years of assisting his father, he organized and set up an elementary school that is still operating successfully. Also during this time, his dream was to own a radio station that would air good gospel music and gospel programming. With much help and hard work, a ten watt KCJH aired its first program in1975.   The call letters have changed to KYCC and the wattage has increased to 50,000 watts and has eighteen stations and translator stations and is the largest station in the city. \n\nHe started the Good Samaritan Center which was instrumental to help and feed the poor.  Under his pastorate he started fourteen daughter works.  \n\nHe served in organizational work for approximately twenty-five years: seven years as Western District Youth President, one year as Western District Sunday School Director, two and a half years as UPCI National Youth President, six years as Assistant General Superintendent of the western zone, and eight years as UPCI General Superintendent.\n\nFollowing are the extra accomplishments and achievements during the eight year tenure of General Superintendent Kenneth F. Haney from January 1, 2002 through January 1, 2010. Here are just a few:\n\n 1. Created Global Impact\n 2. Instituted a program for acknowledgement of the faithfulness of our ministers by honoring them for years of service: ten years, twenty years, thirty years, forty years, and fifty years with a personalized letter from the general superintendent and a certificate of honor\n 3. Began a full service Stewardship Department\n 4. Instituted the Pentecostal Music Association (PMA) to honor the great musicians and singers in the organization.\n 5. Completely restructured the PENTECOSTAL HERALD with a new look and new format.\n 6. Developed the UPCI Flag for the funerals of all licensed ministers \n 7. To give honor and dignity to those who serve the UPCI, he created a pictorial display of all executive board members and all general board members which are beautifully displayed on the wall at WEC in the third floor lobby area.\n 8. Began the program named: Order of the Faith \n9. Established monthly division heads meetings for better communication and staying on target.\n 10. Published three books to instill the vision and mission of the organization. They are (1). ONE VISION, One God, One World, One Church  \n (2). IRRESISTIBLE WAVE   (3). TURNING THE WORLD UPSIDE DOWN\n11. Restructured General Conference, including changing the format of the Wednesday evening service, beginning an outreach for souls over the weekend, and holding a city wide Holy Ghost rally on Sunday evening to reach the lost.\n 12. Developed the Division of Publications.\n 13. Recorded a monthly web cast\n 14. Established Men’s Ministry as a division.\n 15. Developed TALK POINTS - a program for integrating and including younger ministers into the movement beginning with the PASSING THE MANTLE service.  \n 16. Organized the annual Thirty days of Prayer and Fasting."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc3c",
      "state": "published",
      "name": {
        "given": "Ruby",
        "surname": "Klemin",
        "prefix": "Rev.",
        "additional": [
          "B"
        ]
      },
      "ootfYearInducted": 2010,
      "dateOfBirth": "1919-03-04",
      "dateOfDeath": "2012-01-01",
      "details": {
        "biography": "On March 4, 1919, Ruby Bosworth Keyes was born to William John and Eliza Kate Bosworth Keyes, the second oldest of six children, three boys and three girls. Ruby received the baptism of the Holy Spirit at age twelve or thirteen, and remembers the age of fourteen as a time when she settled a lot of things with the Lord and determined to go all the way with Him.\n\nThe family began traveling in evangelistic work when Ruby was seventeen. She was the speaker and the other children would sing.\n\nIn 1940, Ruby began traveling on her own and received her General License with the Pentecostal Church, Incorporated. She made many good friends who believed in the oneness of God. Among them were the Ellis Scism and Ernest Moyer families. They shared scriptures with her and she was baptized in Jesus' Name.\n\nRuby was a part of the United Pentecostal Church since its merger in 1945, and was ordained around 1948, at the insistence of Howard Goss. She was elected the National Youth Secretary around 1947, and served for seven years. Prior to her appointment, she served as Youth President of the Northwest District for seven years.\n\nJohn E. Klemin, Youth President of the Western District, sent a letter to Ruby in 1954, requesting that they begin a Christian correspondence and they later married on May 28, 1955. Brother Klemin was pastoring in Oakland, California, at the time of their marriage.\n\nRuby was soon very busy in a brand new role, as their first daughter, Marla, was born on May 22, 1956. Their family was complete when another daughter, Marilyn, joined them on July 3, 1958.\n\nThrough the years, Ruby was an active part of her husband's ministry, which led them to pastorates in Portland, Oregon, and Vancouver, Washington, and the presidency of Conquerors Bible College, the mission’s field in Argentina, and dean of the Bible School in London, England.\n\nRetiring back to Portland, Oregon, in 1992, they re-opened a home missionary church in Sandy, Oregon, where they pastored until Brother Klemin’s death on January 27, 1995. \n\nAt age ninety-one, she makes her home in Portland, Oregon, with her oldest daughter, Marla, and son-in-law, David Van Beek. She is a vital part of their ministry and until recently, played the piano for each church service."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc3d",
      "state": "published",
      "name": {
        "given": "William",
        "surname": "Parkey",
        "prefix": "Rev.",
        "additional": [
          "C"
        ]
      },
      "ootfYearInducted": 2010,
      "dateOfBirth": "1931-07-29",
      "dateOfDeath": "2011-01-01",
      "details": {
        "biography": "William Coffey Parkey was born on July 29, 1931, on a farm near Paoli, Oklahoma, in the Randolph Community in Garvin County, Oklahoma.   He was the son of Robert Olen and Nellie Fay Parkey.  \n\nIn 1934, C. P. Kilgore held a revival in the Randolph Community and Olen and Fay Parkey received the baptism of the Holy Spirit.  From that time on, the family was involved in the apostolic movement and was part of the Pentecostal Church.  In 1940, W. C. was baptized in Jesus Name and in 1941, at the age of ten, he received the baptism of the Holy Ghost. \n\nW. C. graduated from the Moore, District 66 grade school, and in 1949, he graduated from the Paoli, Oklahoma High School.  In 1954, he graduated from Oklahoma University in Norman, Oklahoma, with a B. A. degree with a major in history, and a minor in English. \n\nIn 1953, while a Junior at O. U., he was given his ministerial license with the UPC and became the Secretary of the Oklahoma Youth Department and in 1955, became the President of the Oklahoma Youth Department and continued in this position for the next eight years.\n\nShortly after graduating from O. U., he preached his first revival in Hope, Arkansas.  In September of 1958, he became pastor of the Oneness Pentecostal Church of Sperry, Oklahoma.  He was pastoring the church without a wife, until September 23 1961, when he married Betty Lou Morgans, of Claremore, Oklahoma.  \n\nIn 1962, Pastor W. C. Parkey and the Sperry Church started a daughter work in Independence, Kansas.  Also, in 1962, Brother Parkey had become a member of the Radio Commission that was attempting to start a radio broadcast called \"Harvestime\".  At the Dallas, Texas, General Conference the first broadcast of Harvestime was aired.  The special song on the first 'Harvestime' broadcast was a song written by author W. C. Parkey, \"Don't Let Me Forget (What the Lord's done for Me).”  \n\nOn February 7, 1963, Elizabeth Elaine was born to the Parkey Family.  \n\nIn December of 1963, Brother Parkey resigned his church to become the Promotional Director of the Harvestime Broadcast at the United Pentecostal Church headquarters, at 2645 South Grand in St. Louis, Missouri. During this year, he not only traveled promoting Harvestime, but also he was the editor for the periodical \"Harvest-Home\".  At this time, he was serving as the editor of the Youth Magazine, \"The Conqueror's Tread!”.\n\nIn 1964, he became pastor at The First Pentecostal Church of Kansas City, Missouri, where he served for ten years. At this same time he was the editor of the Missouri District publication, The Missouri District VOICE! \n\nOn December 30, 1965 Barbara Lois was born to the Parkey family.  \n\nIn 1967, the Missouri District voted to have a Bible School.  The name, \"Gateway College of Evangelism\" was chosen, and W. C. Parkey was asked to be the president. During this time he was asked to serve both on the Curriculum Committee and the Board of Publication of the United Pentecostal Church.  He also served on the Campus Evangelism committee.\n\nOn November 7, 1968, William Robert was born to the Parkey family. On October 27, 1972, Bryan Henry was born.  Then in 1974, Brother Parkey was asked once again to return as the president of Gateway College.  By this time, it was obvious that in order to guide the school efficiently and effectively it could no longer be a part-time job; so reluctantly, Brother Parkey resigned as pastor to become the President of Gateway College.\n\nIn his second term as President, a high school and distance learning program was added.  Gateway sponsored a trip to the Holy Land and a publication, called \"The Panorama,\" was instituted with W. C. Parkey as the editor.\n\nIn 1980, he became the pastor at First United Pentecostal Church of Poplar Bluff, Missouri.  A new church building was built and in 1983 Cornerstone Tabernacle was dedicated. During his time in Poplar Bluff, he served one term as Executive Presbyter of the UPCI, becoming a member of the General Board and the Executive Board.  \n\nIn the year 2000, his son, Bryan Parkey, became his co-pastor at Cornerstone Tabernacle.  In 2002, Brother Parkey retired as pastor and was given the title of Bishop by his church.  Since that time, he has completed a book on Proverbs entitled \"Treasures and Truths\", has completed and published a book of poetry entitled, “Sentimental Journey”, and has completed the manuscript of a book on Ecclesiastes, called \"Devotion and Duty\", which is ready for print."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc3e",
      "state": "published",
      "name": {
        "given": "Glen",
        "surname": "Travis",
        "prefix": "Rev.",
        "additional": [
          "R"
        ]
      },
      "ootfYearInducted": 2010,
      "dateOfBirth": "1938-08-08",
      "dateOfDeath": "2009-09-07",
      "details": {
        "biography": "Glen Ray ''G.R.'' Travis was born in Walthall County, near Tylertown, Mississippi, on August 8, 1938, to Tom J. and Lena Dillon Travis. He was the youngest son and had four sisters and five brothers. \n\nHis family attended Stateline United Pentecostal Church, Tylertown, Mississippi, pastored by the late Reverend Earl Carney. It was in this church that Glen Ray received the Holy Ghost on June 22, 1952, under the ministry of the late Reverend Arlie Holmes. In 1955, at the age of seventeen, Brother Travis heard the call of God to preach the gospel. \n\nOn February 1, 1958, Brother Travis married the love of his life, Delilah Keene. They were blessed with three daughters and ten grandchildren.\n\nIn September 1958, shortly after his twentieth birthday, he was elected to his first pastorate at the Second United Pentecostal Church of Bogalusa, Louisiana. \n\nBeing a Mississippian at heart, Brother Travis returned to his home state in February 1960, where he assumed the pastorate of Powell’s Grove United Pentecostal Church, Jayess, Mississippi, pastoring there until November 1963. \n\nIn June 1968, he became pastor of Pleasant Hill United Pentecostal Church and served there until April 1971. In April 1971, Brother Travis assumed the pastorate of First United Pentecostal Church of Vicksburg, Mississippi, where he remained for 18 years, resigning in August 1989, to serve full-time as Mississippi District Superintendent.\n\nBrother Travis served for a total of twenty one and one-half years. In May 2003, he retired as District Superintendent and was later asked to serve as pastor at Heritage Apostolic Church in Holly Springs, Mississippi, where he stayed from 2005 until 2007.\n\nAfter his retirement as Mississippi District Superintendent, the honor of becoming an Honorary Member was bestowed upon him by both the Mississippi District Board and the UPCI General Board. He was a member of the Mississippi District Board for a total of thirty-four years and the UPCI General Board for approximately twenty-eight years.\n\nBrother Travis did not limit himself to ministry related service. He served on the Board of Nursing under Governor Cliff Finch, and was honored on several occasions to bring the invocation at the legislative opening sessions and for Governor Kirk Fordice’s inaugural day prayer service. \n\nOn the occasion of his sixtieth birthday, based on his life experience, Brother Fred Foster presented him with a Doctorate of Theology from Twin Cities University of West Monroe.\n\nOn September 7, 2009, after a four-month battle with metastatic cancer, Brother Travis completed his work on earth and moved into the heavenly realm where he met the one Lord and Savior he loved so much. \n\nMississippi Governor Haley Barbour stated, ''Mississippi has lost a great Christian leader.'' \n\nIn the words of Mississippi District Superintendent, David Tipton, who considered Brother Travis to be his mentor, ''Passion was what made him a leader. There was no insincerity in him at all. He was real. He never put his family on the back shelf; they were on his calendar before anyone else.''\n\nHe was a leader of leaders, a man of impeccable character, known for his wit and wisdom, but first of all, a Christian in the truest sense of the word. As the epitaph inscribed on his monument reads, ''He served his generation well.''"
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc3f",
      "state": "published",
      "name": {
        "given": "Ernest",
        "surname": "Breithaupt",
        "prefix": "Rev.",
        "additional": [
          "D"
        ]
      },
      "ootfYearInducted": 2011,
      "dateOfBirth": "1937-08-16",
      "dateOfDeath": "2017-01-01",
      "details": {
        "thumbnailUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Breithaupt_Ernest.jpg",
        "photoUri": "https://s3-us-west-2.amazonaws.com/upci-oof-production/images/THUMB_Breithaupt_Ernest.jpg",
        "biography": "Ernest DeWitt Breithaupt was born to Holy Ghost filled parents on August 16, 1937, in Grant Parish three miles outside of Georgetown, Louisiana. During the 1940s, Ernest attended church most of the time in either a brush arbor, a tent, or a store front.  It was a wonderful heritage of pioneer Pentecostal evangelism. \n  \nErnest received the baptism of the Holy Ghost June 19, 1948, and was baptized in the name of Jesus two days later. He began to feel his call into the ministry when he was sixteen.\n \nIn 1957, he went to the Apostolic Bible Institute in St. Paul, Minnesota.  At ABI, he met Wally Ann Bierschenk from Louisville, Kentucky. They were married August 23, 1958. In 1959, they moved to Frankfort, Kentucky to build a church there. It was there in 1960 that their daughter Lori was born. \n\n In 1962, he returned to ABI as an instructor and also pastored the daughter church of Midway Tabernacle in St. Paul Park, Minnesota. The ministry of teaching Bible College students was very fulfilling and meaningful. From there he moved to Apopka, Florida and pastored the United Pentecostal Church where in 1965, their daughter Lisa was born. \n\nIn 1968, he was elected to the pastorate of the Apostolic Church in Belleville, Illinois. This was a thriving church with many receiving the baptism of the Holy Ghost. Gateway College of Evangelism began in 1968 and for its first three years he served as an adjunct faculty member. \n\nIn 1972, Brother Breithaupt was elected to be full-time District Secretary of the Illinois District. This opened a door for him to labor in the organizational work of the United Pentecostal Church fellowship; something for which he had felt a calling placed on him from God. He felt strongly that a Spirit-directed, unified church structure would be a vital part of the end time evangelization effort of the people of God. \n\nHe was elected to be the District Superintendent of the Illinois District in 1981. He held this position for twenty years during which time he initiated the Illinois Ablaze program and led the district in establishing Chicago Metro Evangelism. \n\nIn 1989, he was appointed to the Budget Committee of the General Board and continues to serve there. In 1991, he was authorized to start a Home Missions church in Bloomington, Illinois.  God blessed this effort, the church grew and in 1994, they bought seven acres of property to build the new church where they currently pastor. \n\nOne very enjoyable assignment for him was becoming a part of the Board of Directors of the Tupelo Children’s Mansion in 1972, where he continues to serve as an honorary director."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc40",
      "state": "published",
      "name": {
        "given": "Arthur",
        "surname": "Clanton",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2011,
      "dateOfBirth": "1915-09-29",
      "dateOfDeath": "1976-02-02",
      "details": {
        "biography": "Arthur Lee Clanton was born September 29, 1915, in Iredell, Texas, to Pickford and Julia Clanton.  His brother, R. C., had been born two years earlier. When Arthur was two, his father died, leaving Julia to tend their farm. A year or so later, Julia married a widower, John Lee, who worked for the Santa Fe Railroad in Ft. Worth, Texas.  \n\nWhile Arthur was still in elementary school, his step-father moved the family to Walnut Springs, Texas, where John found employment with the Missouri-Kansas-Texas Railroad. The Clanton family quickly joined the Baptist Church and became active members. In 1931, at age sixteen, Arthur graduated from Walnut Springs High School, one year ahead of his class. \n \nLater in the summer of 1932, Arthur Lee Clanton received the baptism of the Holy Ghost.  He immediately became involved in street evangelism - both in Walnut Springs and other nearby towns. He joined other young people to attend revival services almost every night, where they would help with music, singing and altar work. Soon, he was joining \"evangelistic parties\" for revivals in the hills and prairies of nearby Texas towns. At age seventeen, he preached his first sermon in a small community called County Line.\n\nIn 1937, Brother Clanton was called to be the pastor of the church in Rosepine, Louisiana. It was there that he met Grace Lance, whom he would later marry. In 1938, at age twenty-three, Brother Clanton was ordained into the ministry with the Pentecostal Church Incorporated.\n\n In 1940, Brother Clanton left Rosepine, to serve as assistant pastor of the church in Alexandria, with Brother A. T. Morgan. About a year later, he was asked to move to Houston, Texas, to assist Brother W. E. Kidson as editor of the Apostolic Herald at the PCI headquarters. It was during this time that he and Grace Lance were married in February, 1942.\n\nIn May, 1942, Brother Howard Goss, Superintendent of the Pentecostal Church Incorporated, asked Brother Clanton to consider the pastorate of a church in Shreveport, Louisiana, a position he held until late 1947, at which time he returned to Alexandria, Louisiana, to assume the pastorate there. It was while in Alexandria, that Brother & Sister Clanton's first son, Charles, was born. \n\nBrother Clanton wrote more than fifty gospel songs. The most well-known of these include “I Know I'm Saved” and of course, “My Thanks To Him”. It was in 1951, while in Shady Grove, that Stephen, the Clanton's second child was born. \n\nAt the General Conference in 1955, held in Tulsa, Oklahoma, Brother Clanton was appointed Editor-in-Chief of the UPCI, a position he held until his untimely death on February 2, 1976.  In addition to his editorial duties, he also single-handedly wrote the Adult Sunday School manual for several years, and was the author of a number of tracts. In 1970, after several years of exhaustive research and writing, the original edition of his book, United We Stand, was published."
      }
    },
    {
      "id": "57d4d63e00310711b6a8fc41",
      "state": "published",
      "name": {
        "given": "Bennie",
        "surname": "DeMerchant",
        "prefix": "Rev.",
        "additional": [
          "L"
        ]
      },
      "ootfYearInducted": 2011,
      "dateOfBirth": "1941-01-01",
      "details": {
        "biography": "At sixteen years of age, Bennie DeMerchant and Theresa Shomberg felt God’s call to the mission field of Brazil, although they had never met and were separated by 1,500 miles. Theresa went to ABI and graduated before Bennie arrived from New Brunswick, Canada in 1959.  He acquired a private pilot’s license, married Theresa and graduated in 1962. After a three year pastorate in New Brunswick, Canada, in 1965, this couple journeyed to Manaus, capital of the huge Amazon state in Northern Brazil with their six month old daughter, Beth, where they studied Portuguese and built the home in which they still live. \n  \nIn 1970, Sheaves for Christ helped Brother DeMerchant purchase a Cessna 172 seaplane that still flies after 10,000 hours, which is more than a million miles.  A larger Cessna 206 was purchased in 1977 and has logged 5,000 hours. When he is not flying seaplanes, Brother DeMerchant evangelizes using a fleet of wooden and aluminum canoes, portable cement block forms and hundreds of trained workers as they plant churches in Amazon cities, towns, villages, on islands, lakes, and among Indian tribes. \n\nManaus has a present population of about two million souls with some 200 United Pentecostal Churches. A UPCI convention center has been built on the north side of the Amazon River near the floating seaplane hangar and accommodates up to seven thousand people for special events.  \n\nTheresa DeMerchant, national director of Bible schools, coordinates the work of translating, printing and the curriculum for eighty-two Bible school locations with 292 teachers.  The late Robert Norris started this ministry in Rio de Janeiro.  There are 1,121 two-year students registered and 5,500 alumni in these schools which are all named ABI. \n\nBrother DeMerchant was elected bishop of the UPC of Brazil in 1989, by the thirty-two districts and 1,200 church congregations. Approximately 750 churches are located in the Amazon Basin, the northern half of Brazil.  This hot, equatorial zone is equivalent in size to all the United States east of the Mississippi River.  \n\nFull Throttle, (a Pentecostal Publishing House publication) records the adventures, challenges and fears of flying thousands of hours while opening for evangelism the world’s largest standing forest for His kingdom."
      }
    }
  ]
}
